{
    "Customer Service": "The Customer Service domain encompasses interactive roles designed to streamline and manage service-related processes for users across various industries. These roles include facilitating restaurant discovery and reservations, managing hotel searches and bookings, assisting with apartment rentals and payments, and supporting gas equipment servicing and billing. Through clear communication, workflow guidance, and responsive issue resolution, the domain ensures users receive tailored assistance in finding, booking, and maintaining essential services.",
    "Personal Assistant": "The Personal Assistant domain provides users with comprehensive support across medical, meeting, and financial tasks. It assists with scheduling and managing medical appointments, supports users through diagnosis processes, and handles related actions such as payments or referrals. In meetings, the assistant organizes bookings, rescheduling, cancellations, and technical troubleshooting, ensuring smooth coordination and notifications. For financial needs, it enables banking operations like currency exchange, transaction troubleshooting, cash withdrawals, account management, and secure card services, guiding users through each process efficiently and securely.",
    "E-tailing Recommandation": "The E-tailing Recommendation domain focuses on supporting and enhancing the online shopping experience by offering personalized assistance throughout the customer journey. It covers helping users search, select, and purchase products, managing their carts and orders, providing flexible payment solutions, and addressing post-purchase activities such as returns and issue resolution. Specialized product guidance, like computer sales, is also included, offering tailored recommendations, customization, and support for purchase and return processes. This comprehensive support ensures users receive help at every decision point, fostering a seamless and informed e-tailing experience.",
    "Travel&Transportation": "The Travel & Transportation domain streamlines personal and business travel by offering a suite of services including ride reservations, substitute driver bookings, flight inquiries, and personalized travel assistance. Users can book, modify, or cancel ground transportation and flights, explore available options, and receive real-time support and feedback opportunities. The domain also integrates features like tailored guidance, secure payments, and weather-based travel notifications, ensuring a convenient and engaging experience throughout the planning and booking process.",
    "Logistics Solutions": "The Logistics Solutions domain encompasses a range of customer-facing services, including express parcel delivery, same-city moving assistance, and food delivery support. Each specialized role streamlines the booking, tracking, and management of respective logistics services, supports customer inquiries and claims, and ensures efficient communication and resolution, ultimately driving customer satisfaction across different transportation and delivery needs.",
    "Robotic Process Automation": "The Robotic Process Automation domain orchestrates automated workflows to streamline a variety of essential business operations. It encompasses invoice and ticket processing, comprehensive email management, secure document printing, attendance and shift handling, company seal authorization, and workstation allocation. Each role enforces identity verification, process validation, and user guidance at key stages, supporting secure, efficient, and user-friendly execution of routine tasks across the organization."
}