{
    "restaurant_waiter": "The restaurant_waiter role facilitates both restaurant discovery and reservation processes. It assists users in finding suitable restaurants based on preferences and location, provides recommendations, and manages all steps for booking a reservation, handling availability checks, collecting necessary details, offering alternatives, and resolving common issues in an interactive manner.",
    "hotel_reception": "The hotel_reception role provides an interactive and guided experience for searching, booking, and reserving hotel rooms. It collects user preferences, queries hotel availability via APIs, and presents matching options. Users can refine search criteria, confirm bookings or reservations, and handle payments, while the system manages booking status, offers alternatives when needed, and gathers user feedback to improve satisfaction. Throughout, it ensures clear communication and multiple opportunities for users to adjust or retry their requests.",
    "apartment_manager": "The apartment_manager role facilitates apartment searches, viewings, rentals, and fee management. It guides users in finding and viewing available listings, assists with the rental process, verifies user identities for residency and payment inquiries, manages payment workflows, and provides relevant information or next steps based on user input and workflow outcomes.",
    "gas_equipment_service": "The gas_equipment_service role manages gas-related service interactions by clarifying responsibility for equipment maintenance (distinguishing between homeowner and company responsibilities), facilitating scheduling and inspection of repairs, and handling billing—covering balance inquiries, payments, and service disruption responses. The workflow ensures clear communication to users, guides them through appropriate next steps based on their situation, and supports account verification, payment processing, and service troubleshooting.",
    "medical_consultant": "The medical_consultant role guides users through appointment scheduling, including doctor selection and availability checks, and manages the finalization of bookings with relevant instructions. Additionally, it supports users through the diagnosis process by informing them of their diagnosis status, advising next steps such as medication, hospitalization, or no treatment, and facilitating related actions like payments or referrals for further consultation.",
    "meeting_arrangement": "The meeting_arrangement role oversees the scheduling and cancellation of meetings, guiding users through booking, rescheduling, and reminder options while handling notifications and troubleshooting. It also manages meeting cancellations, confirms user authorization, explains consequences, and assists with technical issues affecting cancellation.",
    "financial_assistant": "The financial_assistant role provides users with a guided digital experience for managing key banking tasks. It enables users to check exchange rates, perform currency exchanges, and troubleshoot transaction failures. The assistant also facilitates cash withdrawals—including scheduling appointments for large sums and guiding users through ATM or branch processes. Additionally, it supports account verification, displays account and transaction information, assists with bank card applications, and directs users to manage card services securely through online platforms.",
    "online_shopping_support": "The online_shopping_support role assists users throughout the online shopping journey by helping them search for products based on their requirements, refine search criteria, and capture feedback when purchases are not made. It also guides users through managing their shopping cart, placing orders, selecting and confirming payment methods, and ensuring flexible payment options. Additionally, it enables users to review, manage, and act on their past orders, such as viewing details, canceling, expediting, changing addresses, or initiating returns—providing end-to-end support with iterative decision points and user feedback incorporated at every stage.",
    "computer_store_sales": "This role assists customers in selecting and purchasing laptops by guiding them through brand choices, specific model recommendations, and customization of specs, then finalizing the sale or encouraging further consideration. It also manages return workflows by distinguishing between quality issues and standard seven-day returns, troubleshooting problems, coordinating with technical support, and ensuring compliance with return policies.",
    "ride_service": "The ride_service role facilitates booking and modifying ride reservations by guiding users through inputting trip details, checking vehicle availability, presenting options, confirming bookings, and handling feedback or ride-change requests. The system ensures user engagement throughout the process, manages unavailable options gracefully, and seeks to improve service based on user feedback or requests.",
    "driving_service": "The driving_service role manages substitute driver reservations by allowing users to book, modify, or cancel surrogate driving appointments. The system matches reservation requests with available vehicles via external APIs, confirms user intentions for actions, and provides outcome updates and feedback opportunities. Users are guided through retries or alternatives when bookings cannot be found or completed, ensuring clear communication at each step.",
    "flight_inquiry": "The flight_inquiry role assists users in searching for available flights and making reservations. It guides users through providing departure details, finding matching flights, displaying options, and handling flight selection. If a user chooses to book, the workflow checks flight availability and processes the booking using user information. Throughout, users can repeat searches, attempt new bookings, or end the session, with clear feedback and invitations to return for future inquiries.",
    "travel_assistant": "The travel_assistant role provides users with personalized travel guidance and ticketing by checking transport availability based on user preferences, facilitating ride selection and secure payment, and assisting with re-selection or alternative options if needed. Additionally, it offers integrated weather services, enabling users to set weather-based notifications or access up-to-date weather forecasts for specific locations and dates, ensuring a seamless and supportive travel planning experience.",
    "express_support": "The express_support role manages workflows for express delivery services, including shipment booking and customer inquiries. It collects and verifies contact details for new shipments, issues tracking numbers, and allows users to update or cancel requests throughout the process. For existing orders, it helps users track shipments, resolve delivery issues, and collect feedback, ensuring efficient service and customer satisfaction.",
    "moving_service": "The moving_service role facilitates booking same-city moves by guiding users through eligibility checks, gathering move details, calculating fees, and scheduling times. It also handles claims for damaged or lost property by verifying policy status, coverage, and eligibility, managing compensation or iterating on claims as needed.",
    "food_delivery_service": "The food_delivery_service role focuses on customer interaction through phone calls to confirm recipient identity, collect satisfaction feedback, offer promotions, and facilitate reservations or appointments. The service ensures privacy, efficiently collects and responds to feedback, schedules follow-up calls or reservations as needed, and provides clear guidance while handling wrong numbers or unavailability with courtesy.",
    "invoice_management": "The invoice_management role handles workflows related to tickets and invoices, allowing users to view and validate ticket details, import tickets via SMS, and send tickets by email. The process includes eligibility checks, input validation, and user feedback at each step. When invoices are available, users can request reimbursements, submit required documents, and receive confirmation or guidance, ensuring a streamlined ticket-to-invoice and reimbursement experience.",
    "mail_administration": "The mail_administration role facilitates user-friendly workflows for essential email management tasks. It guides users through account verification, sending new emails (including address validation, scheduling, and saving drafts), and searching for existing messages. Users are supported in composing, sending, scheduling, or replying to emails, with clear steps and options at each stage, including handling errors and providing help when needed.",
    "printing_service": "The printing_service role manages secure and audited document printing workflows. It verifies file uploads and audits before scheduling print jobs, handles user preferences for copy and color, and maintains clear communication about print status, errors, and pick-up/delivery options. Identity and document checks ensure confidentiality and accuracy, with user notifications at each stage and safeguards to prevent unauthorized or incomplete printing.",
    "attendance_arrangement": "The attendance_arrangement role manages and enforces attendance and shift transfer procedures. It verifies user identity, tracks attendance irregularities such as late arrivals or early departures, records reasons for missed check-ins, issues warnings for repeated offenses, and provides guidance on corrective steps. For shift transfers, it coordinates approval processes based on timing, ensures seamless handover to suitable successors, and facilitates communication or posting of transfer requests when necessary.",
    "seal_management": "The seal_management role oversees the process of selecting and applying company seals on documents, ensuring proper usage based on document type, user need, and stamping permissions. The role manages the verification of user identity, authorization for stamping or printing, and guides users through result handling, including directing them to appropriate collection points or support contacts as needed.",
    "workstation_applicant": "The workstation_applicant role manages user-initiated workstation change requests by verifying user identity, checking and processing application status, and guiding users through verification, selection, and confirmation steps. The workflow provides feedback, notifies users of outcomes, and handles both successful and unsuccessful requests, offering options to retry, confirm, cancel, or receive recommendations as appropriate."
}