{
    "accc3823-7800-49bb-91b1-1189946dcb0b": {
        "domain": "Customer Service",
        "role": "apartment_manager",
        "scenario_name": "Search for apartments",
        "workflow": "：\nflowchart TD\nQV000(Start)--Search for apartments-->QV001>Subgoal: ask for specific needs\nDescription: inquire the user about the number of bedrooms, price, floor, elevator demand, or other needs.\nCall searchApartment to find matching apartments, and check the availability of matching apartments based on the returned is_find]\nQV001--Apartment is not available-->QV002[Subgoal:  inform the user to modify the information\nDescription: inform the user that no apartment meets the given criteria, and ask if the user is willing to adjust the apartment criteria]\nQV002--Yes-->QV001\nQV002--NO-->QV003[Subgoal: apologize to the user\nDescription: tell the user there is no suitable apartment and apologize to the user]\nQV001--Apartment is available-->QV004[Subgoal: inform about the flat and get opinions.\nDescription: inform the user about the apartment according to the returned apartment_message and ask if the user is satisfied with the apartment]\nQV004--User is not satisfied-->QV011[Ask if the user would like to see the apartment before making a decision]\nQV011--Desire to see-->QV010\nQV011--No desire to see-->QV005[Ask if the user wants to know about other apartments]\nQV005--User wants to know-->QV001\nQV005-- User declines to know-->QV003\nQV004--User is satisfied-->QV006[Ask if the user rents the apartment now or takes a look first]\nQV006--Rent Now-->QV007>Subgoal: check if the flat is rented.\nDescription: call apartmentSigning, and check if the lease is successful based on the returned is_apart]\nQV007--Apartment rental succeeded-->QV008[Notify the user that the apartment is successfully rented]\nQV007--Apartment rental failed-->QV009[Subgoal: let the user make a deposit.\nDescription: inform the user that the apartment rental has failed, possibly due to the unpaid deposit or the unsigned occupancy agreement]\nQV006--Have a look first-->QV010[The user needs to wait a moment, and the apartment viewing process is being confirmed]"
    },
    "a33a0c30-08a6-4aca-9b53-30c2a86bbb87": {
        "domain": "Customer Service",
        "role": "apartment_manager",
        "scenario_name": "Make an appointment to view a home",
        "workflow": "：\nflowchart TD\nRP000(Start)--View an apartment-->RP001[Ask if the user already has a satisfied flat?]\nRP001--NO-->RP002[The user conducts an apartment search and then schedules a viewing.]\nRP001--Yes-->RP003>Subgoal: verify the room information.\nDescription: call getRoomInfo to verify and get room information. And check whether the returned room_code is empty.\nIf not, confirm the room number to the user based on the returned room_code.]\nRP003--Parameter empty or no room number desired-->RP002\nRP003--Room number has been confirmed-->RP004>Subgoal: confirm viewing times.\nDescription: call fixTime to confirm the time and check if the returned observable_time is empty?]\nRP004--Value is empty-->RP005[Subgoal: ask the user to reselect.\nTell the user that there is no viewing time available, and require the user to reschedule, look at another house, or wait for another time to view the apartment.]\nRP005--Reschedule-->RP004\nRP005--View other apartments-->RP001\nRP005--Wait for another time-->RP006[The user should make a call when arriving.]\nRP004--Value is not empty-->RP007[Subgoal:  let the user provide viewing times.\nDescription: based on the returned observable_time, fix the time to the user and collect the parameters: go_look_time, user_phone.\nThe user is demanded to come to the gate of the community in time. The salesman will wait at the gate.\nIf necessary, the user can contact the salesman through salesman_phone.]\n\nThe auxiliary parameter information in the workflow is as follows:\n\"go_look_time\": \"Estimated time of viewing, in the format: day + hour + minute. For example, \\\"12:28 on the 17th\\\", \\\"11:00 on the 31st\\\"\"\n\"user_phone\": \"The user\\\"s phone number, 13 digits\""
    },
    "daa55e31-92ff-409f-8222-847fe8db90ac": {
        "domain": "Customer Service",
        "role": "apartment_manager",
        "scenario_name": "Apartment fee payment",
        "workflow": "：\nflowchart TD\nCD000(Start)--Apartment fee payment-->CD001>Current goal: Determine user identity\nDescription: Ask for the user's phone number and call identityChecks\nto query the user's identity\nDetermine whether the user is a resident of the apartment based on the returned is_service]\nCD001--NO-->CD002[Current goal: Let the user re-provide the phone number\nDescription: Inform the user that we have checked his/her identity through the mobile number,\nfinding out that the user does not live in this apartment.\nAsk if the user would like to re-provide the mobile number so that we can check again for him/her.]\nCD002--Provide the mobile number again-->CD001\nCD002--Do not provide the mobile number again-->CD003[Current goal: Say goodbye to the user\nDescription: Inform the user that we only serve the residents of the apartment,\nand say goodbye to the user]\nCD001--Yes-->CD004[Current goal: Ask if the user wants to pay for the apartment now\nDescription: Inform the user of the fee to be paid based on the returned is_fee,\nand ask if the user wants to pay now or later]\nCD004--Pay now-->CD006>Current goal: Determine whether the fee has been paid\nDescription: The user can click on the logistics fee on Gulfstream Apartments' public account and then pay.\nCall paymentFees to query the payment progress.\nJudge whether the fee has been paid or not paid based on the returned is_empty]\nCD006--Not paid-->CD008[Current goal: Remind the user to pay\nDescription: Tell the user that the fee has not been paid in full.\nInform the amount of unpaid fees based on returned whone_amoun, \nand remind the user to pay as soon as possible.]\nCD006--All paid-->CD007[Inform the user that the fee has been paid in full,\nand say goodbye to the user]\nCD004--Pay later-->CD005[Current goal: Remind the user to pay as early as possible\nDescription: Inform the user that he/she can pay later.\nAt the same time, the user is advised to pay the fee as early as possible]\n\nThe auxiliary parameter information in the workflow is as follows:\n\"no_change_reason\": \"Reasons for not replacing, e.g. \\\"have other projects\\\", \\\"on leave\\\"\""
    },
    "68cc0227-0585-4b7b-9982-cfb360cf97f3": {
        "domain": "Customer Service",
        "role": "apartment_manager",
        "scenario_name": "Apartment fee bill inquiry",
        "workflow": "：\nflowchart TD\nDM000(Start)--Apartment fee bill inquiry-->DM001>Current goal: Confirm the user's identity\nDescription: Ask for the user's phone number.\nCall confirmationIdentity to confirm the user information\nand determine whether the information can be found based on the returned is_person]\nDM001--Information can be found-->DM004>Current goal: Determine if billing information can be found\nDescription: Ask the user for the date they want to check the bill.\nCall billingInquiry and determine\nwhether the corresponding billing information can be found based on the returned is_find]\nDM004--Billing information can be found-->DM006[Notify the user of the corresponding billing information based on returned is_message]\nDM004--Billing information can not be found-->DM005[Current goal: Ask if the user wants to change the date\nDescription: Inform the user that the billing information could not be found.\nThe reason may be that the user did not pay the apartment fee on that date.\nAsk the user if they want to change the date]\nDM005--Change the date-->DM004\nDM005--Do not change the date-->DM003\nDM001--Information can not be found-->DM002[Current goal: Inquire if the user wants to change the phone number\nDescription: Inform the user that his/her identity could not be found.\nThat means the user is not a resident of this apartment.\nThe phone number he/she provided should be incorrect.\nAsk the user if he/she is willing to provide the phone number again]\nDM002--Willing to provide again-->DM001\nDM002--Unwilling to provide again-->DM003[Notify the user that we are unable to conduct the inquiry]"
    },
    "b7bb32bf-0d2b-4428-8234-b8c61a266740": {
        "domain": "Logistics Solutions",
        "role": "moving_service",
        "scenario_name": "Moving Service Appointment",
        "workflow": "：\nflowchart TD\nSO000(Start)--Reservation of moving service-->SO001[Subgoal: Ask the user if the destination is in the same city\nDescription: Inform that if the origin and destination of the move are in the same city,\nit is a same-city move, ask the user whether it belongs to.]\nSO001--Yes-->SO003>Subgoal: Inquire the user whether he/she accepts the moving fee.\nDescription: Ask the user for moving information, including:\nthe origin and destination of the move,\ncall receiveMoveInfo to verify the moving fee,\nand inform the user of the moving fee based on the returned moving_fee,\nask whether it can be accepted] \nSO001--NO-->SO002[Subgoal: Ask if changes are required\nDescription: Let the user know that only same-city moving service is provided,\nand inquire whether the user needs to change to it]\nSO002--Need to change-->SO003\nSO002--Do not need to change-->SO004[Say goodbye to the user]\nSO003--Accept moving fee-->SO006>Subgoal: Determine whether moving time is acceptable or not\nDescription: Inquire the user of the desired moving time,\ncall addPackingFee, judge whether the moving time is feasible based on the returned is_moving]\nSO003--Do not accept moving fee-->SO004\nSO006--Moving time is feasible-->SO005[Inform the user that the moving service will be carried out at the corresponding time]\nSO006--Moving time is not feasible-->SO007[Subgoal: Ask the user to choose the moving time again\nDescription: Inform the user that this moving time is not feasible,\nbecause the time he/she chose is not in our working hours.\nAsk the user to choose again]"
    },
    "9bf56f1e-d44b-4728-84f1-0e61209b2a89": {
        "domain": "Logistics Solutions",
        "role": "moving_service",
        "scenario_name": "Insurance claim",
        "workflow": "：\nflowchart TD\nTU000(Start)--Property claim-->TU001>Current goal: Call API to determine whether the property is on the expiration date.\nDescription: Ask the user for the corresponding type and name of damaged and lost property,\nCall verifyInsurance, and determine if the property insurance is valid based on the returned is_ date.]\nTU001--Invalid insurance-->TU003[Inform the user that the insurance\nis not valid and compensation can not be provided.]\nTU001--Valid insurance-->TU002[Judge whether the damaged and lost property\nis in the insurance coverage or not based on the returned is_wheel]\nTU002--Insurance in coverage-->TU004>Current goal: Call API to decide whether the audit passed or not\nDescription: Call submitClaimForm to perform a compensation audit,\nJudge whether the audit is passed based on the returned is_passing]\nTU002--Insurance not in coverage-->TU005[Tell the user that this property is not in our compensation scope.]\nTU004--Audit is passed-->TU006[Current goal: Inform the user that the audit has passed.\nDescription: Tell the user of the amount of compensation based on the returned is_amount,\nand the compensation will arrive in three days]\nTU004--Audit is not passed-->TU007[Current goal: Ask if the claim needs to be readjusted\nDescription: Let the user know why the audit failed based on the returned is_reason,\nand ask if the claim needs to be readjusted]\nTU007--Needed-->TU001\nTU007--Not needed-->TU008[Apologize to the user]"
    },
    "303519f3-9d93-4a47-b23e-e31ed7153757": {
        "domain": "Customer Service",
        "role": "gas_equipment_service",
        "scenario_name": "Gas repairs",
        "workflow": "：\nflowchart TD \nTY000(Start)--Gas Maintenance-->TY001[Subgoal: Inquire about the maintenance location \nDescription: The area within the homeowner's meter is the user's responsibility and may not require our maintenance services.\nThe area outside and including the homeowner's meter is our responsibility and must be maintained by us.] \nTY001--Within Homeowner Meter-->TY002[Subgoal: Inform the user of the self-maintenance option Description: Inform the user that this area can be self-maintained.\nThey may opt for third-party maintenance or request our services. Inquire whether the user wants us to perform the maintenance.] \nTY002--Request our maintenance-->TY003>Subgoal: Request a technician for home service Description: Use 'ContactMaster' to arrange for a technician visit\nand provide the user with the technician's details based on the response received.] \nTY002--Request third party maintenance-->TY004[Subgoal: User to contact independently\nDescription: Inform the user they may contact a technician on their own for maintenance.\nWe will conduct an inspection afterward. Ask if the user will have completed maintenance and be available after seven days.] \nTY004--Available-->TY005[Tell the user we will perform the inspection on the 7th business day.] \nTY004--Unavailable-->TY006[Suboal: Confirm visit timing. \nDescription: If the user is not available for the inspection,\nwe need to collect information on their preferred day for the maintenance check.\nCollection parameters: look_data] \nTY001--Outside of Homeowner Meter-->TY003"
    },
    "71395c1c-1e1a-46d9-90be-08424c7dfe76": {
        "domain": "Customer Service",
        "role": "gas_equipment_service",
        "scenario_name": "Gas fee inquiry and payment",
        "workflow": "：\nflowchart TD\nWT000(Start)--Gas fee inquiry-->WT001>Subgoal: check gas bills\nDescription: Call lookMeter to query the gas cost.\nIf the returned is_success is true, the query is successful.]\nWT001--Successful query-->WT002[Subgoal: Inform gas information to the user\nDescription: Tell the user the money left and ask\nif the user needs a more specific list of expenses based on returned expense_residual.]\nWT002--Need specific list-->WT003[Subgoal: tell the list of expenses\nDescription: Inquire what months of the list the user needs,\n and inform the list of expenses based on returned expense_dict.]\nWT000--Gas bill payment-->WT004>Subgoal: Get the payment link\nDescription: Call getPayLink and ask for the user's information.\nIf the returned is_success is true, the acquisition is successful.\nProvide the user with the payment link based on the returned pay_link]\nWT004--Acquisition is successful-->WT005[Subgoal: Check whether the user has paid\nDescription: Ask if the user has already paid.\nIf so, it is recommended to check whether the gas balance has been received.\n If not, inform the user to pay within 10 minutes.]\nWT002--Do not need specific list-->WT006[Thanks for the call, and goodbye to the user]\nWT001--Unsuccessful query-->WT007[Subgoal: ask the user to re-enter the information\nDescription: The user's information is incorrect, need to enter again.]\nWT004--Acquisition is unsuccessful-->WT007"
    },
    "334e3f27-1c0f-4d66-8869-acb64a86439c": {
        "domain": "Customer Service",
        "role": "gas_equipment_service",
        "scenario_name": "Feedback on Gas Service Interruption",
        "workflow": "：\nflowchart TD\nWU000(Start)--Gas outage feedback-->WU001>Subgoal: Confirm the user's account information\nDescription: Call lookMeter to query the user's gas charge,\ndetermine whether the returned is_success is true.\nIf it is false, tell the user to re-enter the information.]\nWU001--Query is successful-->WU008[Subgoal: Judge whether there is balance or not\nDescription: Determine if the balance is sufficient\nbased on the returned expense_residual.]\nWU008--Sufficient balance-->WU002[Subgoal: Decide if there is announcement\nDescription: Judge if there is a notice based on the returned announcement.]\nWU002--There is announcement-->WU003[Subgoal: Notify the user announcement information\nDescription: Inform the user of the announcement information\nbased on the returned announcement.\nTell the user that it is normal to be without gas temporarily,\nand advise using equipment that doesn't require gas.]\nWU002--There is no announcement -->WU004[Inquire if there is gas around?]\nWU004--Gas is available--> WU005[Subgoal: Tell that there is a failure\nDescription: Inform that the device may be malfunctioning,\nlet someone get it repaired.]\nWU004--Gas is unavailable-->WU006[Subgoal: speculate the possibility of no gas\nDescription: Tell the user that everything is displayed as normal, only there is no gas at the user's home.\nPossible reasons for no gas can be speculated, like sudden maintenance or the main meter being broken.\nThe user can contact the property to solve the problem.]\nWU008--Insufficient balance-->WU007[Subgoal: Let the user know the balance is insufficient\nDescription: Through inquiries, the reason for no gas is insufficient balance.\nThe user needs to pay the bill in time.]"
    },
    "d2fe7ddc-c35f-4d5c-a2cc-a4a2c6496049": {
        "domain": "Robotic Process Automation",
        "role": "workstation_applicant",
        "scenario_name": "Replacement of workstations",
        "workflow": "：\nflowchart TD\nFF008(Start)--Workstation change-->FF009>Current goal: Ask the user's identity\nDescription: Call getUserInfo to get the user identity,\nand determine if it is correct or incorrect based on the returned back_code.]\nFF009--Correct-->FF000>Current goal: Determine the workstation\nDescription: Confirm whether the user has already determined the workstation?]\nFF009--Incorrect-->FF010[Current goal: Apologize to the user\nDescription: The user is misidentified,\nwe need to reject the user's request for a workstation change.]\nFF000--With defined workstation-->FF001>Current goal: verify the workstation\nDescription: Call verificationStation to verify the workstation\nand determine whether it is true or false based on the returned feasible.]\nFF000--Without defined workstation-->FF002>Current goal: Provide feasible workstations\nDescription: Call recommendedStation to get the workstations that can be provided to the user \nand provide the workstation number to the user based on the returned station_object.]\nFF002--Continue to change-->FF001\nFF002--Do not change-->FF003[Current goal: Say goodbye to the user\nDescription: The user doesn't change the workstation, we have to say goodbye to the user.]\nFF001--True-->FF004>Current goal: fill out the application form\nDescription: call applicationForm, \ninform the user whether the application was successful or not \nbased on the returned is_success.]\nFF004--Successful-->FF006[Tell the user that the application has been successful,\nthe workstation will be changed tomorrow]\nFF004--Unsuccessful-->FF007[Inform the user that the application was not successful]\nFF001--False-->FF005[Current goal: Re-select the workstation\nDescription: The workstation is unavailable and we need to ask the user to re-select it.\nThe user can either select a new one or ask us to provide one.]"
    },
    "079403cb-e17b-4d96-bbf9-60c7a5582235": {
        "domain": "Robotic Process Automation",
        "role": "workstation_applicant",
        "scenario_name": "Request the user to change the workstation",
        "workflow": "：\nflowchart TD\nGD000(Start)--Request the user to change the workstation-->GD001>Current goal: Ask for the user's identity\nDescription: Inform the user that here is the workstation requestor,\ncall getUserInfo to inquire about the user's identity,\nand determine whether the user identity is correct or not based on the returned back_code]\nGD001--Correct identity-->GD002>Current goal: Obtain application results\nDescription: Call obtainApplicationResults to obtain application results,\nand confirm whether the result is true or false based on the returned is_pass.]\nGD002--True-->GD003[Current goal: Ask if the user wants to change the workstation\nDescription: Tell the user that the application result is approved and ask if the user wants to change]\nGD003--Do not change the workstation-->GD004[Current goal: collect reasons for not replacing\nDescription: For not changing the workstation, the user has to provide the reasons. \nCollect parameters: no_change_reason]\nGD003--Change the workstation-->GD005>Current goal: Remind  the user to change the workstation as soon as possible\nDescription: Call deskChange,\ninform the user of the deadline for changing the workstation based on the returned replace_time.\nThe user is requested to change the workstation before this time]\nGD002--False-->GD006[Current goal: Notify that the application failed\nDescription: Tell the user that the application was rejected and the reason for failure \nbased on the returned reason.\nThe user is  invited to reapply]\nGD001--Mistaken identity-->GD007[Current goal: Inform of mistaken identity\nDescription: The user's identity is incorrect,\nso the user's application to change the workstation needs to be rejected]\n\nThe auxiliary parameter information in the workflow is as follows:\n\"fault_cause\": \"Fault causes, such as \\\"it won\\\"t turn on\\\"\""
    },
    "2a3d66de-3a03-428b-ae61-8c5ef7ee6f22": {
        "domain": "Logistics Solutions",
        "role": "food_delivery_service",
        "scenario_name": "Online surveys",
        "workflow": "：\nflowchart TD\nBF000(Start)--Participate in the survey-->BF001[Ask if the user is Mr. Wang Zhenyan]\nBF001--NO-->BF002[Current goal: Inform that there is a wrong call\nDescription: Apologize to the user and inform that there is a wrong call]\nBF001--Yes-->BF003[Current goal: Inquire if the user has time to participate in the survey\nDescription: Invite Mr. Wang, the regular customer of Mr. Rice, to do a satisfaction survey.\nAsk if he is willing to.]\nBF003--Willing tO-->BF004[Inquire if the user is satisfied with the service]\nBF004--Satisfied-->BF008[Current goal:Thanks to the user\nDescription: Thanks for the high evaluation,\nand inform the user that good service will be maintained.]\nBF004--Unsatisfied-->BF009[Current goal: Inform that the service will be improved\nDescription: Explain that our company will try to satisfy the user, and apologize to him/her.]\nBF003--Unwilling tO-->BF005[Ask if the user can tell us when he will be available]\nBF005--Can tell-->BF006[Current goal: Know about the user's available time\nDescription: Enquire the user's free time, collect the parameters: free_time.\nInform the user that the call will be made at the appropriate time slot]\nBF005--Can not tell-->BF007[Apologize and say goodbye to the user]"
    },
    "fb31b7e3-1303-45d7-8359-cba9208cb2eb": {
        "domain": "Logistics Solutions",
        "role": "food_delivery_service",
        "scenario_name": "Get Food Voucher",
        "workflow": "：\nflowchart TD\nAX000(Start)--Take part in the promotion-->AX001[Ask if the user is Mr. Wang Zhenyan]\nAX001--NO-->AX002[Current goal: Inform that there is a wrong call\nDescription: Apologize to the user and inform that there is a wrong call]\nAX001--Yes-->AX003[Current goal: Inquire if the user has time to participate in the promotion\nDescription: Inform Mr. Wang that this is Mr. Rice. Recently there was a promotion where all dishes were 6% off.\nAsk if the user has time to come.]\nAX003--Have no time-->AX004[Current goal: Inquire if the user has time to come over\nDescription: Inform that this promotion starts next Monday,\nends next Sunday. \nInvite the user again if he/she has time to come over]\nAX004--Still have no time-->AX005[Say sorry to the user]\nAX003 & AX004--Have time-->AX006[Current goal: Ask if the user needs to make an appointment\nDescription: Tell the user to make an appointment in advance this time. \nAfter making an appointment, \nthere's no need to queue up to participate in the promotion.\nAsk if an appointment is needed.]\nAX006--Need an appointment-->AX007[Inquire if the user wants to make an appointment now or later]\nAX007--Make an appointment now-->AX010>Current goal: Call API to determine whether the appointment is successful.\nDescription: Obtain the user's ID number and name, and call userReservation.\nDetermine whether the appointment is successful based on the returned is_reserce]\nAX010--Successful-->AX011[Inform the user the success of the appointment]\nAX010--Unsuccessful-->AX012[Current goal: Tell that the appointment was failed\nDescription: Inform the user that the appointment is not successful. \nThere may be errors in the ID number and name.\nThe user needs to provide the ID number and name again.]\nAX012--Reprovide-->AX010\nAX007--Make an appointment later-->AX008[Notice if the user wants to make an appointment, contact us by the following Monday]\nAX006--Need no appointment-->AX009[Inform the user that can queue up to participate in the promotion]"
    },
    "a30c11b7-ec42-4020-aa11-87ce92f50518": {
        "domain": "Personal Assistant",
        "role": "meeting_arrangement",
        "scenario_name": "Launch the meeting",
        "workflow": "：\nflowchart TD\nLA000(Start)-- Launch the meeting-->LA001>Subgoal: Confirm the meeting feasibility.\nDescription: inquire the user for meeting information based on scheduleMeeting. Call scheduleMeeting,\nand confirm if the meeting is feasible based on the returned whether?]\nLA001--Meeting is available-->LA002[Subgoal: Notify the meeting is feasible.\nDescription: tell the user that the meeting is feasible and a text message has been sent to make contact. The user should enter the meeting on time, and ask if the user needs a meeting link?]\nLA002--Link needed-->LA003[ Ask the user if the reminder is needed]\nLA003--Yes-->LA004[Collect parameters: contact_time. Notify the user that the reminder will be given in advance.]\nLA003--No need to inform-->LA005[The user is invited to participate in the meeting on time.]\nLA004-->LA005\nLA001--Meeting is unavailable-->LA006[Subgoal: inform the user of reasons.\nDescription: inform the user of the cause of failure based on the returned reason, and notify the user who cannot attend the meeting based on the returned unable_attend.]\nLA006-->LA007[Ask if the user wants to adjust the meeting content. Or force the meeting to start?]\nLA007--Start meeting forcibly-->LA008>Call scheduleMeeting, set up a meeting forcibly]\nLA008-->LA002\nLA007--Adjust meeting content-->LA001\nLA002--No link needed-->LA009[Provide the user with an entry link according to the returned join_link.]\nLA009-->LA003\n\nThe auxiliary parameter information in the workflow is as follows:\n\"contact_time\": \"Contact time, positive integer, in minutes\""
    },
    "23e2583a-74c5-4caa-8137-6d0dca3506fe": {
        "domain": "Personal Assistant",
        "role": "meeting_arrangement",
        "scenario_name": "Cancel meeting",
        "workflow": "：\nflowchart TD\nPN000(Start)--Cancel DingTalk meeting-->PN001>[Subgoal: confirm the meeting status.\nDescription: call inspectionMeeting to check meetings, determine whether the meeting has started or not based on the returned is_start]\nPN001--Meeting starts-->PN002[Determine whether the meeting can be canceled based on the returned is_quit]\nPN002--Meeting cannot be canceled-->PN003[Find out the reason why the meeting can't be canceled is mobile phone issues or network connection issues according to the returned is_reason]\nPN003--Mobile phone issues-->PN004[Subgoal: ask the user to use a computer.\nDescription: inform the user that DingTalk on mobile phones may have some bugs or compatibility issues, which will lead to uncanceled meetings, and the user is invited to try to log in the account using the PC DingTalk and then cancel the meeting.]\nPN003--Network connection issues-->PN005[Subgoal: require the user to check the network\nDescription: mention that the network connected with the user's device is unstable, which may result in the inability to cancel the meeting. And advise the user to try to connect to other networks or restart network devices. Then try to cancel the appointment again.]\nPN001--Meeting does not start-->PN006[Guide the user to open DingTalk to find the scheduled meeting on the home page, enter the meeting details interface and select Delete to cancel the meeting.]\nPN002--Meeting can be canceled-->PN007[Inform that once a meeting is canceled, it cannot be changed. Ask if the user is sure to cancel the meeting]\nPN007--User does not confirm-->PN011[Suggest that the user can think carefully before replying]\nPN007--User confirms-->PN008[Judge whether the user's identity is the meeting host based on the returned is_main]\nPN008--Yes-->PN009[Click end meeting button to cancel the meeting]\nPN008--NO-->PN010[The user can ask the meeting host if he/she can end the meeting. If the host agrees, the meeting can be ended]"
    },
    "118f7450-5f7a-499b-82f3-c05f25d3a42b": {
        "domain": "Travel&Transportation",
        "role": "flight_inquiry",
        "scenario_name": "Check flights",
        "workflow": "：\nflowchart TD\nMO000(Start)--Check flights-->MO001>Inquire the user for departure city and date,\ncall planeSearch, and confirm if flight information can be found based on the returned plan_dict]\nMO001-- Information unfound-->MO005[Inform the user that there are no available flights on the route and ask the user to reselect]\nMO005--reselect-->MO001\nMO001--Information found-->MO004[Notify the user that a suitable flight can be found,\ndisplay the list of flights found based on the returned plan_dict, and ask the user for preferred flights]\nMO004--Flights preferred-->MO006[Inquire the user for flight ID, and tell the user of the flight price based on the returned plan_price]\nMO004--Flights unpreferred-->MO002[Ask whether the user wants to continue searching?]\nMO002--Yes-->MO001\nMO002--NO-->MO003[Say goodbye to the user.\nThe user is always welcome to inquire in the future]"
    },
    "a7bb4821-c848-4593-a520-694190df31a0": {
        "domain": "Travel&Transportation",
        "role": "flight_inquiry",
        "scenario_name": "Book a flight",
        "workflow": "：\nflowchart TD\nSK000(Start)--Book a flight-->SK001>Inquire the user for the Flight ID,\ncall checkAvailability to confirm flight status,\nand check flight availability based on the returned is_air]\nSK001--Flight is available--> SK002>Tell the user that the flight is available.\nAsk the user for ID number and name, call reserveFlight, and check if the reservation is successful based on the returned is_successful ]\nSK002--Reservation succeeded-->SK003[Inform the user that the reservation succeeded, and notify the user of booking details based on other returned values of reserveFlight. \nAsk if the user wants to book again]\nSK002--Reservation failed-->SK004[Notify the user that the reservation failed and ask if the user wants to book again]\nSK004  & SK003--User books again-->SK002\nSK004 & SK003--User does not rebook-->SK006[The user is welcome to contact again for future needs]\nSK001--Flight is unavailable-->SK005[Inform the user that the flight is unavailable, and confirm if the user wants to book another flight]\nSK005--User books another flight-->SK001"
    },
    "682b15cd-fb08-4ec6-b8be-3620033aa040": {
        "domain": "Logistics Solutions",
        "role": "express_support",
        "scenario_name": "Express shipping",
        "workflow": "：\nflowchart TD\nWW000(Start)--Send courier-->WW001>Current goal: Determine whether the shipment can be shipped\nDescription: Ask the user for sender and recipient information,\nincluding the sender's name, telephone number, address and the recipient's name, telephone number and address.\nCall getPackageType to determine whether the mail can be sent based on the returned is_sending]\nWW001--Mail can not  be sent-->WW002[Current goal: Inform the user of the incorrect information \nDescription: Inform the user that the information provided is incorrect. \nAsk the user whether to change the information or drop the shipment]\nWW002--Drop the shipment-->WW003[Say goodbye to the user]\nWW001--Mail can be sent-->WW006[Current goal: Ask the user whether to change the information\nDescription: Inform the user that the shipping requirements have been met.\nThe user needs to confirm the sender information and recipient information.\nOnce the information is established, it cannot be changed. \nThe user has to confirm if he/she wants to change the information]\nWW006--Do not change information-->WW004[Current goal: Inform the user of the tracking number\nDescription: Call sendCourier and tell the user the logistics number based on the returned is_num.\nConfirm if they want to continue sending]\nWW004--NO-->WW005[Say goodbye to the user]\nWW004--Yes-->WW001\nWW006 & WW002 --Change the information-->WW001"
    },
    "7795cb1c-ed92-476b-9a18-9701645e5da9": {
        "domain": "Logistics Solutions",
        "role": "express_support",
        "scenario_name": "Query express information",
        "workflow": "：\nflowchart TD\nOC000(Start)--Query express information-->OC001>Current goal: Ask the user for the order number to query\nDescription: Ask the user for the order number to query.\nCall getFullShipmentDetails and determine whether the corresponding order is found based on the returned is_search]\nOC001--Order is not found-->OC011[Current goal: Let the user re-provide the order number\nDescription: Tell the user that the order cannot be found.\nThe reason may be that the order number is wrong. \nThe order number needs to be re-provided.]\nOC011-- Reprovide the order number-->OC001\nOC001--Order is found-->OC002[Current goal: Inform the user that the corresponding order information has been successfully found\nDescription: Inform the user that the corresponding order information has been successfully found.\nTell the user the order information table based on the returned ticket_forms\nand determine whether the item was delivered based on the returned is_sending]\nOC002--Item was not delivered-->OC003[Ask if the user wants to urge logistics or to check the current location of the order]\nOC002--Item was delivered-->OC004[Inform the user that the express has been delivered.\nAsk if he/she has received the delivery.]\nOC004--Have not  received-->OC005[The user is advised to go to the nearby Cainiao Station to pick up the delivery]\nOC004--Received-->OC006[Ask if the user is satisfied with our express service]\nOC006--Unsatisfied-->OC007[Explain to the user that we will redouble our efforts in the future\nand strive to satisfy them next time]\nOC006--Satisfied-->OC008[Thanks for the user's high comments]\nOC003--Rush logistics-->OC009[Let the user know that we will contact the Courier immediately, and strive for faster delivery]\nOC003--View the current location of the order-->OC010[Tell the user the current position of the order based on the returned is_position]"
    },
    "0b866d96-bf17-45c4-ae4e-dbc2b1f5898b": {
        "domain": "E-tailing Recommandation",
        "role": "computer_store_sales",
        "scenario_name": "Notebook purchase",
        "workflow": "：\nflowchart TD\nCY000(Start)--Notebook recommendation and purchase-->CY001[Current goal: Ask if the user has a favorite brand\nDescription: Inform the user that there are three brands in our store, Honor, Xiaomi and Asus,\nask if there is a favorite brand among them]\nCY001--NO-->CY003[Current goal: Explain the advantages of these three brands.\nDescription: Tell that these three brands of notebooks are thin and light, easy to carry,\nand have high performance, ask the user if he/she is willing to consider it]\nCY003--Willing to consider-->CY002\nCY003--Unwilling to consider-->CY004[Current goal: Apologize to the user\nDescription: Apologize to the user for not being able to recommend a suitable notebook]\nCY001--Yes-->CY002>Current goal: Recommend a notebook to the user\nDescription: Call nameRecommended,\nand tell the user the brand name of the recommended notebook based on the returned notebook_name,\nask if he/she is satisfied with this notebook brand]\nCY002--Not satisfied-->CY006[The brand will be recommended again]\nCY006--Recommend again-->CY002\nCY002--Satisfied-->CY005>Current goal: Inquire if the user wants to buy it\nDescription: Ask for the user's desired screen size, color, and memory capacity, \ncall notebookRecommended,\nand tell the user the price of the recommended notebook based on the returned is_price,\nand ask whether the user wants to buy]\nCY005--Buy-->CY007[Current goal: Remind the user to make payment\nDescription: Share the payment link\nbased on the returned is_link,\nand help the user complete the payment]\nCY005--Do not buy-->CY008[Tell the user to think about it]"
    },
    "05623f8a-c038-436f-8a15-7912f0d84651": {
        "domain": "E-tailing Recommandation",
        "role": "computer_store_sales",
        "scenario_name": "Laptop Returns",
        "workflow": "：\nflowchart TD\nEC000(Start)--Laptop returns-->EC001[Inquire the user whether the return is due to quality issues\nor seven days with no reason to return]\nEC001--Quality problems-->EC002>Current goal: Call API to advise the user\nDescription: Ask the user about the model of the laptop and the specific problem.\nCall laptopMaintenance to provide a solution based on the returned is_solution,\nlet the user fix the laptop according to the solution provided,\nand ask if the quality problem of the laptop is resolved]\nEC002 & EC003 --Resolved-->EC005[Inform the user can consult in the future if there are any related problems.]\nEC002 --Unresolved-->EC003[Current goal: Inquire whether the problem is resolved or not\nDescription: Inform the user of the technician's contact information based on the returned is_phone,\nand seek help from the technician, and then ask the user whether the problem is solved]\nEC003--Still unresolved-->EC009>Current goal: Determine whether it is possible to return the product\nDescription: Call returnCondition\nand determine if a return is feasible based on the returned is_return]\nEC009--Unsatisfied-->EC010[Current goal: Inform that a return is impossible\nDescription: Tell the user that the return condition is not met,\nso it is not possible to return the laptop]\nEC009--Satisfied-->EC006[Current goal: Return the laptop for the user\nDescription: Ask the user to pack the laptop and bring it to the store in Computer City to check the notebook.\nIf the notebook is not damaged, it will be returned to the user on-site.]\nEC001--Seven days no reason to return-->EC004[Tell the user can return the laptop and ask if the laptop is well-packed]\nEC004--Yes-->EC007[The user sends the laptop to the store of Computer City and we will process the return]\nEC004--NO-->EC008[Current goal: Inform that the laptop\ncan not be returned\nTell that the user can only return the product if the packaging is in good condition]"
    },
    "6f586cef-ec6f-4b7b-a005-30f535f48283": {
        "domain": "Robotic Process Automation",
        "role": "mail_administration",
        "scenario_name": "Send mail",
        "workflow": "：\nflowchart TD\nNI000(Start)--Send an email-->NI001>Current goal: Determine whether the user has an email account\nDescription: Ask the user for the ID number and the email address they want to use.\nCall accountInquiry to determine whether the user has an email account based on the returned is_posts]\nNI001--Has an email account-->NI003>Current goal: Judge whether the recipient's email address is available\nDescription: Ask the user for his/her email account.\nCall emailFeasibility and determine whether emails can be sent to the recipient based on the returned is_sent]\nNI003--NO-->NI004[Current goal: Inform the user of the incorrect account number\nDescription: Tell the user that the email cannot be sent because the recipient's email account is incorrect.\nAsk the user if he/she is willing to provide the recipient's email account again]\nNI004--Unwilling to provide again-->NI005[Say goodbye to the user]\nNI004--Willing to provide again-->NI003\nNI003--Yes-->NI006>Current goal: Ask if the user wants to send an email now\nDescription: Remind the user to confirm the subject and outline of the email.\nCall writeEmail and inform the user of the edited message based on the returned post_ending.\nAnd ask the user if they want to send the email now or later]\nNI006--Send the email now-->NI008>Current goal: Send the email\nDescription: Call enterEmai to send the email,\nand informs the user that the message has been sent]\nNI006--Send the email later-->NI007[Current goal: Ask if the user wants to use the draft box\nDescription: Remind the user that he/she can store email content in the draft box,\nwhen the user edits an email next time, the contents of the draft box can be used directly.\nAsk if the user wants to use the draft box]\nNI007--Want to use the draft box-->NI009>Current goal: Save the edited information in the draft box\nDescription: Call draftBox to collect edited information,\nand inform the user that it has been stored in the draft box]\nNI007--Do not want to use the draft box-->NI005\nNI001--Does not have an email account-->NI002[Current goal: Tell the user to register first\nDescription: Inform the user that since there is no email account, he/she needs to register first.\nAfter registration is complete, login, and then the mailbox can be used to send emails]"
    },
    "7b1fb560-7939-4bb1-8039-0f037fd5de4a": {
        "domain": "Robotic Process Automation",
        "role": "mail_administration",
        "scenario_name": "Reply to an email",
        "workflow": "：\nflowchart TD\nNN000(Start)--Reply to an email-->NN001>Current goal: Determine whether there is an email account\nDescription: Ask the user for the ID number and the email address they want to use.\nCall accountInquiry and determine whether the user has the email account based on returned is_post]\nNN001--Has an email account-->NN003>Current goal: Determine if the email can be found\nDescription: Ask for information in the message that the user replied to,\nincluding sender and email sending time.\nCall inquireMail, and determine whether the email can be found based on the returned is_found]\nNN001--Does not have an email account-->NN002[Current goal: Inform the user that registration is required\nDescription: Inform the user that since there is no email account, he/she needs to register first.\nAfter registration is complete, login, and then the mailbox can be used to send emails.]\nNN003--Email cannot be found-->NN004[Current goal: Inform the user that it was not found\nDescription: Tell the user that the email could not be found,\nask if the user can provide the email information again]\nNN004--Cannot provide again-->NN005[Inform the user that we couldn't find the email.]\nNN004--Can provide again-->NN003\nNN003--Email can be found-->NN006>Current goal: Ask if the user wants to reply now\nDescription: Call EmailRespnse and inform the user of the\ncontent of the reply based on the returned is_thing.\nAsk if the user wants to reply now or later]\nNN006--Reply now-->NN007>Current goal: Help the user reply\nDescription: Call sendEmail and inform the user that the email\nhas been successfully replied to]\nNN006--Reply later-->NN008[Inform the user to contact us if he/she needs to reply to an email]"
    },
    "c311d9c6-7a0e-4569-ba54-bf1d273f10dd": {
        "domain": "Personal Assistant",
        "role": "financial_assistant",
        "scenario_name": "Currency exchange",
        "workflow": "：\nflowchart TD\nWB000(Start)--Exchange currency-->WB001[Subgoal: confirm the user's intent.\nDescription: ask if the user wants to know about the exchange rate first or convert the currency directly.]\nWB001-- Know about the exchange rate-->WB002>[Subgoal: inform the user of the exchange rate\nDescription: call acquisitionRate, and tell the user of the exchange rate based on the returned exchange_rate_table]\nWB001--Exchange currency directly-->WB003[Subgoal: check if the operation is successful.\nDescription: call exchangeMoney to exchange currency, and check if it is success according to the returned exchange_result.]\nWB003--Is success-->WB004[Tell the user to check the currency that has been sent to his/her account]\nWB003--Isn't success-->WB005[Subgoal: confirm the cause of failure.\nDescription: judge which of the following is corresponding: no exchange times, exceed the foreign exchange limit, or have an insufficient balance based on the returned exchange_result]\nWB005--No exchange times-->WB006[Explain that the number of Express Redemption times for this year has been used up, so they have to go to the counter of the People's Bank of China to conduct this]\nWB005--Exceed the foreign exchange limit-->WB007[Inform that the foreign exchange control limit has been exceeded, please go to the counter of the People's Bank of China to apply for]\nWB005--Insufficient balance-->WB008[Inform that the balance in the account is insufficient]"
    },
    "f40d5a18-9483-49d1-8d1e-539223773893": {
        "domain": "Personal Assistant",
        "role": "financial_assistant",
        "scenario_name": "Appointments for large withdrawals",
        "workflow": "：\nflowchart TD\nGK000(Start)--Schedule a withdrawal-->GK001[Subgoal: confirm the amount of withdrawal\nDescription: If the one-time withdrawal amount is 20,000 RMB or less, the user can complete it directly at the ATM.\nIf it is more than 20,000 RMB, an appointment is required.]\nGK001--Way to find an ATM-->GK002[Subgoal: inform the ATM location\nDescription: ATMs are generally located in each outlet.\n The specific address can be found in the map software.\n Of course, the user can ask the live customer service about the nearest ATM.\n Withdrawals are supported throughout the day when the ATM has money.\n The maximum amount per withdrawal is 5,000 RMB, with a daily limit of 4 transactions, culminating in a total of 20,000 RMB.]\nGK002--Find the nearest ATM-->GK003>Subgoal: search for ATMs\nDescription: Ask the user's location based on the returned findATM and call findATM.\nInform the user of the nearest ATM location based on the returned ATM_dict.]\nGK001--Make a reservation-->GK004>Subgoal: verify the user's identity\nDescription: Inquire about the user's identity information based on the returned VerificeInfo,\n and call VerificeInfo to verify whether the identity information is true.\n If the returned test_value is true, it is true. Otherwise, the user will need to provide new identification information.]\nGK004--True-->GK005>Subgoal: confirm the intention to withdraw\nDescription: According to the instructions of the superior bank, the user must first inform the withdrawal intention when making an appointment for a large deposit.\nCall intentReview, and judge whether the returned is_success is success? If it is successful, the user's intention is approved and can make an appointment.\nIf not, the system will consider the intention to be abnormal. Inform the user that the intent is not up to the mark and the submission needs to be rechecked.]\nGK005--Verification passed-->GK006>Subgoal: Confirm the details of reservations\nDescription: Find out the amount the user wants to withdraw. Call reservationCash to make a reservation.]\nGK006--Is true-->GK007[Subgoal: remind the user to withdraw money\nDescription: The user can withdraw money at the reserved bank after the returned Number days.\nThe reservation is only valid on that day. A new appointment is required after the expiration date.\nA bank card and ID card are required for withdrawals.]\nGK006--Is not true-->GK008[Subgoal: inform reasons for the failure\nDescription: Inform the user of the reasons for the appointment failure based on the returned reason.\nThe user is advised to check the account and make sure that there is enough balance to be withdrawn.\nIf necessary, he/she can visit the outlets for account-related checks.]"
    },
    "e27d36bc-1b76-464f-bbed-c5dbc39dda07": {
        "domain": "Personal Assistant",
        "role": "financial_assistant",
        "scenario_name": "Check the balance and transfer the bank card account",
        "workflow": "：\nflowchart TD\nVD000(Start)--Handle banking services-->VD002>Subgoal: ask for information\nDescription: ask for the user's ID number and bank card account number.\nCall queryBank, and check the availability of  the user's bank account based on the returned is_founding]\nVD002--Bank account found-->VD004[Inform the user of the bank balance based on the returned card_money and ask if the user has any questions about it.]\nVD004--Have questions-->VD003>Subgoal: inform the user about transactions\nDescription: call bankInFormation, and inform the user of the last five transactions on the bank card based on the returned card_message. \nThe corresponding balance can be viewed in the transaction information]\nVD004--No questions-->VD001[Ask if the user needs other services]\nVD002--No bank account found-->VD005[Subgoal: ask the user to reprovide information.\nDescription: tell the user that the account number is not found due to possible errors in the ID number and bank card account number.\nAsk if the user would like to provide it again]\nVD005--Yes-->VD002\nVD005--No-->VD007[Say goodbye to the user]\nVD001--Other services needed-->VD006[Ask whether the user wants to apply for a bank card or transfer a bank card account]\nVD001--No other services needed -->VD007\nVD006--Apply for a bank card-->VD008>Subgoal: inform of the online process of applying\nDescription: th user is reminded that only the online bank card process is available:\nThe user should first log in to the corresponding mobile banking app, click on the option of applying for a bank card, and fill out the application form, which includes name, ID number, contact information, and type of bank card. \nRequire the user to submit an application, call cardProcessing, and check whether the bank card application is successful based on the returned is_attends]\nVD008--Application failed-->VD011[Subgoal: notify that the application failed\nDescription: inform the user that the application is unsuccessful.\nThe user is required to check the name, ID number, contact information, and bank card type before submitting the information again.]\nVD008--Application succeeded-->VD010[Subgoal: tell the user to wait for mailing\nDescription: inquire the user for the address to receive the card, and collect parameter: card_position.\nInform the user that the bank card will be sent by mail according to the returned card_position]\nVD006--Bank card account transfer-->VD009[Ask the user to log in to the bank APP on the mobile phone, find the option to change password, then find the function to change password in the security center and other menus, and follow the instructions to change it]\n\nThe auxiliary parameter information in the workflow is as follows:\n\"card_position\": \"The address to receive the bank card, a string, \\\"Zone E, Jinhui Centralmingzhu, Chongqing\\\"\""
    },
    "095a5a47-659f-4725-a029-83883f642982": {
        "domain": "Personal Assistant",
        "role": "medical_consultant",
        "scenario_name": "Make an appointment with a doctor",
        "workflow": "：\nflowchart TD\nII000(Start)--Make an appointment with a doctor-->II001[Ask if the user knows the desired doctor, appointment time, and the doctor's availability]\nII001--User doesn't know the doctor's availability-->II002>Call JudgeDoctorSTime to confirm the doctor's availability at the scheduled time,\nand confirm if the doctor is available based on the returned if_feasible?]\nII002--Doctor is available-->II003[Tell the user that the doctor is available, and ask if  the user would like to continue the appointment or check another doctor]\nII003--Check another doctor-->II002\nII001--User has no desired doctor-->II005>Call findDoctor to check all the doctors of the corresponding department at the scheduled time,\nand tell the user about the available doctors based on the returned doctor_list]\nII001--User all knows-->II004>Call appointmentRegister to make an appointment with a specific doctor at a designated time. If the returned if_success is success, users are required to come to the hospital 15 minutes in advance to pay the registration fee. \nIf the returned if_success is not success, briefly describe the reasons for failure based on the returned if_success.]\nII003--Continue the appointment-->II004\nII002--Doctor is unavailable-->II006[Tell the user that the doctor is unavailable, and request the user to choose another doctor]"
    },
    "12233102-ba1a-4302-b284-05428cc3547f": {
        "domain": "Personal Assistant",
        "role": "medical_consultant",
        "scenario_name": "Get diagnostic results",
        "workflow": "：\nflowchart TD\nSO000(Start)--Ask about diagnosis-->SO001>Ask for user information, call getMedical to check medical progress, and confirm if the doctor issues a diagnosis based on the returned is_check.]\nSO001--Doctor has not issued a diagnosis yet-->SO005[Notify the user that the doctor has not issued a diagnosis yet, and ask the user to wait for a while before coming back. \nIf the diagnosis has not been made for a long time, ask the user to contact the doctor for another appointment.]\nSO001--Doctor has  issued a diagnosis-->SO002[Notify the user that the doctor has issued a diagnosis, and confirm if the user needs medication, hospitalization, or no treatment based on the returned is_check.]\nSO002--User needs medication-->SO003>Inform the user of medication information based on the returned purchase_medication.\nAsk if the user wants to make a quick purchase.\nQuick Purchase will use the cost of the user's bound account. If the user is not bound or has an insufficient balance, request the user to bind, recharge, or not use quick purchase.\nIf so, call orderMedication to order medication, and process information for the user based on the returned result_text. \nIf not, request the user to pay at the hospital charge office, and then pick up the medicine according to the charge sheet.]\nSO002--User needs hospitalization-->SO004[Inform the user of the need for hospitalization, and ask the user to go to the front desk of the corresponding department to make a record.\nSpecific information will be provided by the front desk.]\nSO002--User needs no treatment-->SO006[The user is diagnosed with no need for treatment and asked the user to relax. \nBeing doubtful, the user can go to a larger hospital or seek psychological consultation.]"
    },
    "1bf1ee30-d926-43fd-809f-7403004348ae": {
        "domain": "Customer Service",
        "role": "restaurant_waiter",
        "scenario_name": "Find a restaurant",
        "workflow": "：\nflowchart TD\nPB000(Start)--Search for a restaurant-->PB001>Subgoal: Check suitable restaurants.\nDescription: Inquire the user for the location, cuisine preference, and dining time, \ncall searchRestaurant to find restaurants based on the criteria,\nand confirm suitable restaurants based on the returned data]\nPB001--No restaurants found-->PB002[Notify the user that no restaurants match the given criteria and ask if the user would like to try again]\nPB002--User intends to search for other restaurants-->PB001\nPB002--NO-->PB003[Apologize to the user and say goodbye]\nPB001--Restaurants found-->PB004[Subgoal: Inquire about the user's satisfaction\nDescription: Inform the user that the restaurant has been found,\ndisplay the list of restaurants and their details based on the returned data,\nand ask if the user is satisfied]\nPB004--User not satisfied with the option-->PB005[Notify the user that other restaurants can be recommended,\nand ask if the user would like]\nPB004--User satisfied with the option-->PB006[Tell the user of the restaurant location based on the returned address, and ask the user to go to the restaurant to experience it]\nPB005--Need-->PB001\nPB005--NO need-->PB003"
    },
    "31fe2a3e-ab57-49d3-b5c7-fdf85584a72b": {
        "domain": "Customer Service",
        "role": "restaurant_waiter",
        "scenario_name": "Book a restaurant",
        "workflow": "：\nflowchart LR\nWB000(Start)--Book a restaurant-->WB001>Subgoal: Confirm restaurants availability\nDescription: Ask the user for the restaurant name, number of people, and desired reservation time,\ncall checkRestaurantAvailability，\nand confirm restaurant availability based on the returned available]\nWB001--Reservation available-->WB002>Subgoal: If the reservation is successful \nDescription: Notify the user that the reservation is available.\nAsk the user for contact information and special requests,\ncall bookRestaurant to make the reservation，\nand check if the reservation is successful or failed based on the returned reservation_successful]\nWB001--Reservation not available-->WB004[Subgoal: Choice of a different time\nDescription: Apologize to the user as the reservation is not available,\nand ask if the user would like to choose a different time.]\nWB004--Yes-->WB008[Apologize to the user and say goodbye]\nWB004--NO-->WB006[Thank the user's understanding, and inquire the user for a new reservation time and check again for availability]\nWB002--Reservation successful-->WB003[Subgoal: Reservation is successful \nDescription: Notify the user that the reservation is successful, and inform the user of the booking information form based on the returned reservation_details. \nUsers are requested to come to the restaurant at the time of reservation. Not arriving at the restaurant 20 minutes after the reservation time will be considered to forfeit the reservation]\nWB002--Reservation failed-->WB005[Subgoal: Request to try again\nDescription: Notify the user of reservation failure possibly due to the incorrection of \nthe given contact information.\nRequest the user to check the contact information and try again]\nWB005--User tries again-->WB002\nWB001--No restaurants found or restaurants are closed at this reservation time-->WB007[Subgoal: Invitation to resubmit the information\nDescription: Inform the user that the reservation cannot be made because the name of the restaurant is incorrect or the restaurant is closed at the time of the reservation.\nUsers are invited to re-supply the restaurant name, number of people, and desired reservation time.\nand re-confirm restaurant availability]\nWB006 & WB007--User confirms again for availability-->WB001"
    },
    "2dfe18d3-125b-4587-a2b6-03546ec751f0": {
        "domain": "E-tailing Recommandation",
        "role": "online_shopping_support",
        "scenario_name": "Search for products",
        "workflow": "：\nflowchart TD\nUI000(Start)--Search for products-->UI001>Subgoal: confirm needs and search for products.\nDescription: inquire the user about product type, brand, price lower limit, price upper limit, and other product needs, \ncall searchProducts and check whether suitable products can be found based on the returned is_finding]\nUI001--No suitable product found-->UI002[Subgoal: ask to adjust the demand.\nDescription: inform the user that no products meet the given needs, and ask if the user would like to change product requirements]\nUI002--Do not change requirements-->UI005[Subgoal: apologies to the user\nDescription:tell the user that there are no suitable products and apologize to the user]\nUI001--Suitable product found-->UI003[Subgoal: show goods to the user\nDescription: inform the user of the product according to the returned apartment_message and ask if the user is satisfied with the product]\nUI003--User is satisfied-->UI006[Ask if the user is willing to buy]\nUI006--User will buy-->UI007>Subgoal: add products to the shopping cart\nDescription: call addCart to add the current item to the shopping cart, and inform the user of the results of joining based on the returned add_result]\nUI006--User will not buy-->UI008[Inquiry the user about reasons for unwilling to buy, and collect parameters: is_reason.]\nUI003--User is unsatisfied-->UI004[Subgoal: persuade the user to consider other items\nDescription: inform the user that there are a wide variety of products, which can fully satisfy the user's experience, and ask if they want to know about other products]\nUI004--Yes-->UI001\nUI002--Change requirements-->UI001\nUI004--NO-->UI005\nUI008-->UI004\n\nThe auxiliary parameter information in the workflow is as follows:\n\"is_reason\": \"Reasons for not willing to purchase products\""
    },
    "a908ae8d-9758-4a3f-adaa-f0846a361775": {
        "domain": "E-tailing Recommandation",
        "role": "online_shopping_support",
        "scenario_name": "Shopping cart management",
        "workflow": "：\nflowchart TD\nFU000(Start)--Cart management-->FU001>Subgoal: confirm the shopping cart Items.\nDescription: call lookShopCart to get the information of the shopping cart, and tell the user the contents of the shopping cart based on the returned value of lookShopCart.]\nFU001-->FU002[Ask the user whether to check out, continue purchasing, or modify the shopping cart?]\nFU002--Modify the shopping cart-->FU003>Subgoal: change the shopping cart.\nDescription: call changeShopCart to modify the shopping cart. If the user wants to modify the model, please delete it and purchase it again.\nThen tell the user the content of the shopping cart based on the returned value of changeShopCart.]\nFU003-->FU002\nFU002--Check out-->FU004>Subgoal: notify the amount.\nDescription: inquiry the user about the product they checked out based on the shopping cart checkout function shopCartCheckout, and call shopCartCheckout after the user confirms twice, and tell  the user the amount based on the returned momey]\nFU004-->FU005[Ask the user whether to use account balance or use a link to pay?]\nFU005--Use account balance-->FU006>Subgoal: verify account amount and pay\nDescription: call useAccountbBalance, verify account balance and pay, and check whether it is yes based on the returned pay_result?]\nFU006--Is yes-->FU009\nFU006--Is not yes-->FU007[Tell the user that the balance is insufficient and ask if they want to use the link to pay?]\nFU007 & FU005--Use the link to pay-->FU008>Subgoal: call the link payment function\nDescription: call linkPay to get payment information and payment link, and judge whether the returned result_pay is success?]\nFU008--The result is success-->FU009[Let the user know that the payment is successful and the merchant is being notified.]\nFU008--The result isn't success-->FU010[Inform the user of the payment link based on the returned pay_link and ask the user to pay.]\nFU010-->FU011[Ask the user if the payment is completed?]\nFU011--Payment is completed-->FU008\nFU011 & FU007--Can't pay-->FU012[The user needs to pay within 24 hours. Otherwise, the order will be canceled.]"
    },
    "35dbbd92-f9bc-4b4d-b21e-0e64fcff628a": {
        "domain": "E-tailing Recommandation",
        "role": "online_shopping_support",
        "scenario_name": "Order operations",
        "workflow": "：\nflowchart TD\nUU000(Start)--Check order-->UU001>Subgoal: get order information.\nDescription: call lookOrders to get brief order information. \nIf the returned account_details shows a normal account, tell the user rough order information based on the returned order_info. \nIf the account is abnormal, let the user provide the correct information.]\nUU001-->UU002[Confirm if the user wants to operate on a certain order?]\nUU002 & UU007--NO-->UU003[Say goodbye to the user]\nUU002 & UU007--Yes-->UU004[Subgoal: confirm the current state of the order.\nDescription: ask the user which order to operate on among returned of lookOrders, and check whether the corresponding current_status is received?]\nUU004--Goods received-->UU005[Tell the user that the product has been received, and ask if the user wants to return it?]\nUU005--Not return the good-->UU006[Explain to the user that received orders can only be returned.]\nUU006 & UU009 & UU010-->UU007[Ask if there are other orders needed to be operated?]\nUU005--Return the good-->UU010\nUU004--Goods not received-->UU008[Confirm whether to check order information, cancel the order, expedite the order, or change the address?]\nUU008--Check order information-->UU009>Subgoal: get order details and inform the user.\nDescription: call viewDetails to obtain detailed order information, and deliver the information to the user based on the returned value of viewDetails.]\nUU008--Not check order information-->UU010>Subgoal: notify the result of the operation\nDescription: call orderOperate to do order operation, and tell the result to the user according to the returned result_order]"
    },
    "8173ea61-ee58-4213-abe2-a1fa14c160f0": {
        "domain": "Robotic Process Automation",
        "role": "printing_service",
        "scenario_name": "File printing",
        "workflow": "：\nflowchart TD\nBY000(Start)--Print documents-->BY001[Current goal: Confirm the file location\nDescription: Ask if the files printed by the user are uploaded to the company's system.\nFiles need to be uploaded to the company's system and must be reviewed before being printed,\npreventing some documents that cannot be printed but are printed]\nBY001--Not uploaded to the system-->BY004[Current goal: Let the user upload files\nDescription: Tell the user to upload files beforehand,\nand tell us to print them after obtaining the file ID. This is for auditing.]\nBY001--Uploaded to the system-->BY002[Current goal: Confirm the number of copies printed and other requirements\nDescription: Ask if the user has other printing needs, such as color requirements.\nIf not, then the document is printed in black and white, one copy.]\nBY002-->BY003>Current goal: Schedule a print\nDescription: Call getPrint, select the parameters according to the user's needs, and enter the parameters.\nAfter the call is completed, determine whether the returned is_success is normal or incorrect.\nIf the returned is_success is an error, the file was not found.]\nBY003--Normal-->BY004[Current goal: Inform printing matters\nDescription: Tell the user that files have been obtained.\nThe documents will be reviewed first,\nand then be printed after it has been approved.]\nBY003--Incorrect-->BY005[Current goal: Tell the user about the file error.\nDescription: Inform the user that the file was not searchable \nbecause it contains content that cannot be printed.\nThe user needs to double-check the documents and re-upload them before letting stuff know.]"
    },
    "594e07e2-4189-4655-9a42-a9e07c511629": {
        "domain": "Robotic Process Automation",
        "role": "printing_service",
        "scenario_name": "Notification of file results",
        "workflow": "：\nflowchart TD\nYI000(Start)--Notify the file result-->YI001>Current goal: Confirm the user's identity\nDescription: Ask for the identity of the employee who answered the phone, \nincluding name and employee number.\nCall getEmployeeStatus to get the employee status,\nand judge the identity of the employee based on the returned employee_name and employess_num.\nIf the identity is correct, the employee will be informed of the result of the document printing. \nOnly if the identity is correct, the following steps can be proceeded.\nIf the identity is wrong, apologize to the user.]\nYI001--Identity is correct-->YI002>Current goal: Get the result of the file print\nDescription: Call getPrintResults to get the file print result,\nand according to the returned is_result\nto determine whether the application is successful or not.]\nYI002--Successful application-->YI008[Current goal: Confirm the number of pages in the document\nDescription: We need to confirm the number of pages in the file with the user \nso that we don't give the wrong file and cause information leakage.\nQuery the number of pages of the user's file based on the returned page_num which is one of the returned value of getPrintResults.\nThe user cannot be told the correct answer.]\nYI008--Correct answer-->YI003[Subgoal: Ask the user how to get the file\nDescription: The user can go to the pickup location to pick the file up on his/her own,\nor it can also be delivered by our staff.\nThe user needs to give clear requirements.]\nYI008--Incorrect answer-->YI007[Current goal: Tell the failure of delivering of the file\nDescription: Let the user know that the number of pages of the document provided is inconsistent with that\nof the document is about to be delivered now.\nDeliveries are not possible in accordance with the Company's regulations.\nIf in doubt, the user can contact the person in charge of document printing for details.\nIf the user knows the answer is incorrect and re-gives the correct answer,\ndocuments still cannot be delivered.]\nYI003--Pick up on his/her own-->YI005[Current goal: Inform the pick-up location\nDescription: Based on the returned getPrintResults,\nthe user is told the location where the file is currently stored \nand its pickup number is pick_up_umber.\nThe user needs to pick up the file in time.]\nYI003--Delivered by staff-->YI006[Current goal: Collect user workstation locations\nDescription: Collect the location of the user's workstation and collect the parameter: work_place.\nTell the user that the delivery of the document is about to be scheduled \nand the user needs to wait at the desk.\nIf there is no one at the workstation at the time of delivery, the delivery will not be made.]\nYI002--Unsuccessful application-->YI004[Current goal: Inform the reason for the failure of the application\nDescription: There can be two reasons for the application failure. \nThe first is the file is not up to specification. \nThe second is the file volume is too large.\nThe user can contact the person in charge of document printing to understand the situation and then re-apply.]\n\nThe auxiliary parameter information in the workflow is as follows:\n\"work_place\": \"工位位置,是一个编号,比如“J810-1-4”、“J809-6-4”、\""
    },
    "22a5b4b4-0182-42d3-9069-f18f5e93239e": {
        "domain": "Travel&Transportation",
        "role": "travel_assistant",
        "scenario_name": "Travel guidance",
        "workflow": "：\nflowchart TD\nRY000(Start)--Request travel guidance-->RY001>Subgoal: ask for travelling information.\nDescription: inquire about the travel mode, departure point, departure date, arrival point, and other information.\nCall travelDirections, and check the availability of a suitable vehicle based on the returned is_holiway]\nRY001--Vehicle is unavailable-->RY007[Noyify the user that the vehicle is available and require the user to reselect the information]\nRY001--Vehicle is available-->RY002[Subgoal: tells the user about the ride.\nDescription: inform the user about the ride based on the returned holiway_message, and ask if the user is satisfied with the ride provided.]\nRY002--User is satisfied-->RY003[Ask if the user wants to buy the ticket now or think about it again]\nRY002--User is not satisfied-->RY008[Ask if the user wants to reselect the information]\nRY008 & RY007--Reselect-->RY001\nRY003--Think about it again-->RY009[Tell the user to think carefully before replying]\nRY003--Buy the ticket now-->RY004>Subgoal: ask for payment with the link.\nDescription: inform the user of the link to purchase the ticket based on the returned travel_link, and require the user to complete the payment.\nCall ticketStatus, and determine whether the user has completed the payment based on the returned is_tickets]\nRY004--Payment completed-->RY005[Notify the user that the payment is completed]\nRY004--Payment uncompleted-->RY006[Notify the user that the payment is not completed, and the user should reopen the payment screen to pay]\nRY006--Pay again-->RY004\nRY008--Do not reselect-->RY010[Apologize to the user for not providing a suitable ride]"
    },
    "f9da7809-38d8-43bb-b6fd-fd3cf110ada2": {
        "domain": "Travel&Transportation",
        "role": "travel_assistant",
        "scenario_name": "Weather services",
        "workflow": "：\nflowchart TD\nYH000(Start)--Weather services-->YH004[Ask if the user wants to check the weather or turn on weather reminders]\nYH004--Turn on weather reminders-->YH005[Inform the user that morning and evening weather reminders and unusual weather reminders are provided, \nand ask the user if desired one]\nYH005--Unusual weather reminders-->YH006[Tell the user that imminent changes in rainfall and air quality will be detected in time \n\nand such messages will be sent to him/her timely]\nYH005--Morning and evening weather reminders-->YH007[Notify the user that weather news of today/tomorrow will be sent to him/her at 7:00/19:00 every day]\nYH004--Weather check-->YH001>Inquire about the location and date, call getWeatherForecast,\nand confirm if the corresponding weather data can be found based on the returned status]\nYH001--Weather data available-->YH002[Inform the user of the availability of weather data，\ndisplay weather forecast based on the returned weather_dict and ask if the user needs another location or date]\nYH002 & YH003--Check continued-->YH001\nYH001--No weather data available-->YH003[Inform the user that the corresponding weather data is not available because of status,\nand ask if the user wants to continue the check]\nYH002 & YH003--No further check required-->YH008[Say goodbye to the user]"
    },
    "6727cdb8-f374-4db8-b59b-8f48f7ba0250": {
        "domain": "Customer Service",
        "role": "hotel_reception",
        "scenario_name": "Find a hotel",
        "workflow": "：\nflowchart TD\nWI000(Start)--Search for a hotel-->WI001>Subgoal: Find available hotels\nDescription: Ask the user for destination, dates, and preferences, call API:searchHotel to retrieve hotels based on the given criteria]\nWI001--No available hotels found-->WI002[Subgoal: No hotels found\nDescription: Inform the user that  no hotels match the given requirements,\nand ask if the user would like to reselect a hotel]\nWI002--No need to reselect-->WI006[Apologize to the user for not being able to provide a suitable hotel]\nWI002--Reselect-->WI001\nWI001--Available hotels found-->WI003[Display the list of available hotels based on the returned data, \nask if the user is satisfied with the hotel offered]\nWI003--User is satisfied with the option-->WI005[Subgoal: Ask the user for rating\nDescription: Inform the user that the search is complete, and ask for an evaluation of this service.\nCriteria are categorized as good, fair, or poor for users to choose ]\nWI005--Good-->WI007[Thanks for the good review the user gives, and the user is welcome for further inquiries.]\nWI005--Fair or poor-->WI008[Subgoal: Inquire reasons\nDescription: Inquire about the reason for not giving a positive review, collect parameter: person_reason, \ninform the user that corrections will be made based on reasons, and thank the user for using this service]\nWI005--No review-->WI009[Thank the user for using this service and say goodbye]\nWI003--User is not satisfied with the option-->WI004[Subgoal: Whether the user accepts recommendations\nDescription: Inform the user that this hotel may not match the given requirements, \nbut other hotels can be recommended, \nand ask if the user needs]\nWI004--NO-->WI009\nWI004--Yes-->WI001\n\nThe auxiliary parameter information in the workflow is as follows:\n\"person_reason\": \"Reason why user doesn\\\"t want to give us an evaluation.\""
    },
    "6ecb63f6-74ce-4f9a-bdcb-d25c04dce41a": {
        "domain": "Customer Service",
        "role": "hotel_reception",
        "scenario_name": "Book a hotel room",
        "workflow": "：\nflowchart TD\nIW000(Start)--Book a hotel room-->IW001>Subgoal: Confirm room availability\nDescription: Ask the user for the hotel name and number of rooms required, call API:checkHotelAvailability to check room information, \nand confirm room availability based on the returned availability]\nIW001--Rooms available-->IW002[Notify the user that rooms are available, and ask the user to confirm the booking]\nIW002--User has not confirm-->IW006[Subgoal: Require the user to consider\nDescription: Inform the user that once a booking is confirmed, it can not be changed.\nThe user is required to think carefully and quickly before replying]\nIW002--User confirms-->IW005>Subgoal:  Whether the booking is successful\nDescription: Ask the user for personal details and payment info, call API:bookHotel to make the reservation, \nand check whether the value is 'true' or not based on the returned reservation_successful, \nIf two consecutive booking attempts fail, consider it a reservation failure, \nand advise the user to seek alternative accommodations]\nIW005--True-->IW008[Inform the user that the hotel has been successfully reserved]\nIW005--False-->IW004[Subgoal: Try again\nDescription: Notify the user of reservation failure and its reasons  based on the returned reservation_successful.\nAsk the user to try again]\nIW004--Rereserve-->IW005\nIW001--Rooms not available-->IW003[Subgoal: Invitation to book another hotel\nDescription: Apologize to the user for the unavailability of rooms due to high demand and numerous customers.\nInquire if they would like to consider booking at a different hotel]\nIW003--Yes-->IW001\nIW003--NO-->IW007[Apologize to the user for not being able to offer a suitable hotel.\nSay goodbye to the user]"
    },
    "acb85afe-23c5-49b5-b66a-9615b1df0260": {
        "domain": "Customer Service",
        "role": "hotel_reception",
        "scenario_name": "Book a hotel",
        "workflow": "：\nflowchart TD\nQX000(Start)--Book a hotel-->QX001>Subgoal: Confirm available hotels.\nDescription: Ask for the hotel name where the user is staying, \ncall API: getHotelInfo to retrieve hotel details,\nand confirm available hotels based on the returned success]\nQX001--Hotel found-->QX007>Subgoal: Whether the user makes a reservation\nDescription: Call appointmentFee,\ninform the user of the reservation fee based on the returned hotel_fee,\nand ask if the user wants to make a reservation for this hotel]\nQX007--User has not confirm-->QX008[Inform the user that taking time to think is allowed before replying]\nQX007--User confirms-->QX006>Subgoal: Whether the reservation is successful\nDescription: Inform the user of the payment link for the reservation fee based on pay_fee and request the user to complete the payment.\nCall appointment_Fee5 to organize the requested services,\nand check whether the service result is 'true' or not based on the returned service_scheduled]\nQX006--True-->QX002[Inform the user of the room number based on the returned room_info]\nQX001--Hotel unfound-->QX003[Inform the user that there is an error in the provided hotel name,\nand request the user to provide a new hotel name]\nQX003--User reprovides-->QX001\nQX006--Reservation failed-->QX004[Subgoal: Whether the user tries again\nDescription: Inform the user of the failed reservation and its reasons based on the returned room_info,\nand ask if the user wants to reselect the hotel name and make a reservationn]\nQX004--User wants to try again-->QX001\nQX004--User does not want to retry-->QX005[Apologize to the user and say goodbye]"
    },
    "b8a59056-00a4-4457-aa4f-f361ece37b1f": {
        "domain": "Robotic Process Automation",
        "role": "seal_management",
        "scenario_name": "Seal Request",
        "workflow": "：\nflowchart TD\nOG000(Start)--Use a seal-->OG001[Current goal: Confirm seal type\nDescription: Seal types include:\nofficial seal, financial seal, invoice seal,\ncontract seal and invoice seal.\nConfirm which type of seal the user needs?]\nOG001--Official seal-->OG003[Current goal: Decide if an official seal is required. The official seal can be used for all letters, official documents, contracts, letters of introduction, certificates or other company materials issued in the name of the company. The official seal is not required in other cases.]\nOG001--Financial seal or contract seal-->OG002[Current goal: Tell the user that the seal is not for external use\nDescription: Tell the user that the financial seal and contract seal are for exclusive use, not for external printing service.]\nOG001--Invoice seal-->OG005[\"Current goal: Ask for invoice type\nDescription: Ask the user whether it is an electronic invoice or a paper invoice.\nIf it is an electronic invoice, is the word 'Seller (Seal)' \nin the lower right corner of the invoice? \nIf not, it means that the electronic ticket does not need to be stamped.\nif it is other types, it needs to be stamped.\"]\nOG005 & OG003--Stamp is required-->OG007[Current goal: Confirm document type\nDescription: Confirm whether the document to be stamped is an electronic document or a paper document.]\nOG007--Paper document-->OG008[Current goal: Teach the user how to stamp paper documents\nDescription: Inform the user that the financial office will stamp paper documents. \nThe user needs to contact the head of the company about the location of the finance office.]\nOG007--Electronic document-->OG006>Current goal: Request stamping\nDescription: Call applicationStamp to apply for a stamp. After the correct call, \ntell the user that the invoice seal will show the result after three hours, or six hours in the case of an official seal.]\nOG005 & OG003--Stamp is not required-->OG004[Current goal: Inform that there's no need to stamp\nDescription: Inform the user that the required print request cannot be approved according to company regulations.\nThe main reason is that the application for a seal is not justified and \ndoes not meet the company's requirements or the use of a seal does not belong to the company regulations.]"
    },
    "1e9503fd-0460-4d53-bb02-80dc443cfee2": {
        "domain": "Robotic Process Automation",
        "role": "seal_management",
        "scenario_name": "Seal State Notification",
        "workflow": "：\nflowchart TD\nKI000(Start)--Results reporting-->KI001>Current goal: Confirm the user identity\nDescription: Ask for the identity of the employee who answered the phone, including name and work number.\nThen call getEmployeeStatus to get the identity of the employee, \nand judge the employee's identity based on the returned employee_name and employess_num.\nIf the identity is correct, this employee needs to be informed of the result of the print request and the following steps to be taken. \nIf the identity is incorrect, apologize to the user.]\nKI001--Identity is correct-->KI002>Current goal: Get print result\nDescription: Call getPrintingResults to get the printing result, \nand determine whether the application is successful or failed based on the returned is_result.]\nKI002--Application is successful-->KI003[Current goal: Ask the user how to pick up the document\nDescription: The user can go to the pick-up location or the document can be delivered to the user.\nAsk the user to give a clear indication.]\nKI003--Collect the document on their own-->KI005[Current goal: Tell the pick-up location\nDescription: Inform the user of relevant information based on the returned getPrintingResults, \nincluding the current location of the file based on the returned locations\nand its pickup number based on the returned pick _ up _ umber.\nAsk the user to pick up the document.]\nKI003--Delivery of the document-->KI006[Current goal: Collect the user's workstation\nDescription: Know about the location of the user's workstation, and collect the parameter: work_place.\nTell the user that the delivery of the document is about to be scheduled. Ask the user to wait at the workstation. \nIf there is no one at the workplace at the time of delivery, it will not be delivered.]\nKI002--Application is failed-->KI004[Current goal: Notification of reasons for unsuccessful application\nDescription: There may be two reasons for application failure.\nThe first is that the document does not meet the specification.\nThe second is that the applying information is not sufficient.\nLet the user contact the person in charge of printing for information and then apply again.]"
    },
    "5c7032fe-6c0c-4a2d-8c43-cc6e006aa387": {
        "domain": "Robotic Process Automation",
        "role": "attendance_arrangement",
        "scenario_name": "Attendance Anomaly Detection",
        "workflow": "：\nflowchart TD\nES000(Start)--Early leave or tardiness-->ES001[Current goal: Ask if the user is aware of any early leave or tardiness\nDescription: The user has a record of leaving early or arriving late today, ask if he/she is aware of it.]\nES001--Unaware-->ES002[Current goal: Inquire if the user has checked in\nDescription:  If there is no record of early leave or tardiness, it might be due to the user not checking in at the time clock.\nWe need to ask if the user failed to check in on the time clock.]\nES002--Did check in-->ES007[Current goal: Notify that the check-in failed\nDescription: The user said he/she has checked in, but we can't find any records here,\nit may be the user's operation error. \nThe user needs to use the clock-in machine in accordance with the regulations next time.]\nES002--Did not check in-->ES003[Current goal: Ask for the reason for early leave/tardiness\nDescription: Inquire whether the reason for early leave or tardiness is facial recognition failure, \ncongestion or other reasons.]\nES001--Aware-->ES003\nES003--Face recognition failure-->ES004>Current goal: Collect user's facial information\nDescription: Call getUserPhoto to get the user's face information,\nand judge whether it is true based on the returned result.\nIf it is not true, it means the user's facial information is wrong.\nAsk the user to re-upload until the returned result is true]\nES003--Forgot to check in-->ES005>Current goal: Examine frequency of forgetfulness\nDescription: Call recordForgotPunch to get the number of times that the user forgot to check in this month,\nand determine if it exceeds three times based on the returned forget_num]\nES005--Exceeds three times-->ES009[Current goal: Inform user of excess tardiness\nDescription: Inform the user that their tardiness exceeds three times,\nand it has been recorded by the system.\nLet the user not to be late again]\nES005--Does not exceed three times-->ES008[Current goal: Remind the user of timing\nDescription: The user has not forgotten to check in more than three times,\nand ask the user not to be late again next time.]\nES003--Other reasons-->ES006[Current goal: Collect other reasons\nDescription: Collects the reason why the user did not check in.\nCollect parameter: other_reason]"
    },
    "11fd35e3-a085-46ac-8321-47018196b9d9": {
        "domain": "Robotic Process Automation",
        "role": "attendance_arrangement",
        "scenario_name": "Shift Handover",
        "workflow": "：\nflowchart TD\nSA000(Start)--Relieve-->SA001>Current goal: Confirm the user's identity\nDescription: Call getUserInfo to confirm the user's identity, \nand determine whether the user identity is correct or not based on the returned back_code]\nSA001--Correct identity-->SA002[Current goal: Inquire about shift transfer deadline\nDescription: Ask the user about the shift transfer deadline. \nIs the shift time within three days 'inclusive' or beyond three days?]\nSA001--Mistaken identity-->SA003[Current goal: Denial of services\nDescription: The user's identity is incorrect,\nso the user's request for a shift transfer is denied.]\nSA002--Within three days-->SA004[Current goal: Ask who will take over\nDescription: Ask if the user has found a successor,\nwho must be another employee of the same level in the company]\nSA002--Beyond three days-->SA005[Current goal: apply in writing\nDescription: Tell the user that the shift time has exceeded three days\nand a written application needs to be made by the supervisor.]\nSA004--No successor found-->SA006[Current goal: Ask if the user needs help\nDescription: Ask if the user needs our help or continues to look for a successor on their own?]\nSA004--A successor found-->SA007>Current goal: Collect shift information\nDescription: Call collectShiftInformation to collect shift information,\nand inform the user to have the successor contact us for a shift transfer and fill out the information]\nSA006--Find the successor on the user's own-->SA008[Current goal: Let the user find his/her successors\nDescription: The user is asked to find his/her successors.]\nSA006--Find the successor here-->SA009>Current goal: Find exchangeable times\nDescription: Call getCanExchanged to obtain information on exchangeable employees, \nand check whether the information is empty based on the returned worker_object]\nSA009--Information is not empty-->SA010[Current goal: Ask the user to contact on his/her own\nDescription: Tell the user the employee information in the worker_object,\nand let the user reach out on his/her own.]\nSA009--Information is empty-->SA011[Current goal: Ask if  the user will upload information\nDescription: Tell the user that no other employee has posted a shift request,\nand ask if the user needs to upload information. \nAfter uploading information, other employees can see the user's application.]\nSA011--Information uploaded-->SA012>Current goal: Upload the user's requests\nDescription: Call uploadUserRequest to upload the user's requests, and tell the user to be patient]\nSA011--No information uploaded-->SA013[Current goal: Apologize to the user\nDescription: Apologize to the user for the unsatisfactory service provided to the user]"
    },
    "0a560d1f-cccd-4dc4-b229-95a2c28f0953": {
        "domain": "Robotic Process Automation",
        "role": "invoice_management",
        "scenario_name": "Invoice management",
        "workflow": "：\nflowchart TD\nFK000(Start)--Check the ticket-->FK001>Subgoal: check the ticket\nDescription: Call lookTicket to view the ticket]\nFK001-->FK002[Subgoal: tell the user the contents of the ticket\nDescription: Inform the user the specifics of the ticket based on the returned ticket_dict.\nInform the returned ticket_ai to the user,\nIf the user wants to know about one of the invoices, explain the details.]\nFK000--SMS import tickets-->FK003>Subgoal: validate the new ticket\nDescription: The user provides the corresponding SMS content of the imported ticket.\nCall the checkTicket to check if there is a ticket. If the returned is_exist is true, there are tickets.  If it is false, there are no tickets.]\nFK003--Have tickets-->FK004>Subgoal: import a new ticket\nDescription: Call inBar to import the new ticket into the user's ticket package]\nFK003--Have no tickets-->FK005[Subgoal: inform there' are no tickets\nDescription: Tell that the content of the ticket SMS provided is invalid,\n the user needs to re-check the content of the SMS message.]\nFK000--Send tickets-->FK006>Subgoal: send the ticket to the mailbox\nDescription: Call sendTicket, and send the invoice according to the email address.\n If the returned is_success is true, the sending is successful.\n If the returned is_success is false, the user is asked to check the email address.]"
    },
    "91e3d725-792c-473f-b731-47c3f216439b": {
        "domain": "Robotic Process Automation",
        "role": "invoice_management",
        "scenario_name": "Invoice reimbursement",
        "workflow": "：\nflowchart TD\nWN000(Start)--Invoice reimbursement-->WN001>Subgoal: view tickets\nDescription: Call lookTicket to view the user's tickets.\nIf returned is_success is true, it is successful, or the user information is wrong.]\nWN001--Successful-->WN002[Subgoal: present content to the user\nDescription: Show the user the invoice in returned in-ticket_dict and ask if there are any invoices needed to be reimbursed?]\nWN002--Not all invoices-->WN003[Subgoal: inform that the invoice can't be reimbursed\nDescription: Explain that the invoice is in the invoice package, but it can't be reimbursed.\nThe reimbursement period might have expired, or has already been reimbursed.]\nWN002--None of invoices-->WN004[Subgoal: Tell that there's no ticket\nDescription: Tell that there is no ticket, the user can collect the ticket first.\nIf other processes involve obtaining invoices, they can also be used.]\nWN002--All invoices-->WN005>Subgoal: fast reimbursement\nDescription: Call trimTicket to get the reimbursement link and inform the user\nof the reimbursement link based on the returned ticket_link.]\nWN005-->WN006[Subgoal: ask if the user wants to submit reviews\nDescription: Inquire if the user needs to send this reimbursement link to the review department.\nIf he/she doesn't need to, say goodbye to the user]\nWN006-->WN007>Subgoal: submit for review\nDescription: Inquire if the user still needs to send to last_section based on returned trimTicket.\n Call reimburse based on the user's answer for moderation.]"
    },
    "1e056ba1-4084-4ad6-8db7-276cd2ecd51b": {
        "domain": "Travel&Transportation",
        "role": "driving_service",
        "scenario_name": "Consultation and appointment for Substitute driving service",
        "workflow": "：\nflowchart TD\nFP000(Start)--Apply for a substitute driver-->FP001>Current goal: Call the API to determine whether there is a vehicle\nDescription: Ask about the information the user needs to make a driving reservation,\nincluding time, start point, end point.\nCall listService and determine whether there is a corresponding vehicle based on the returned is_car]\nFP001--Have no corresponding vehicles-->FP002[Current goal: Inquire if the user wants to re-select\nDescription: Inform that the right vehicle has not been found,\nAsk whether the user would like to re-select.]\nFP002--Need to select vehicles again-->FP001\nFP002--Do not need to select vehicles again-->FP003[Current goal: Apologize to the user\nDescription: Inform the user that there is no suitable vehicle and apologize for that.]\nFP001-- Have corresponding vehicles-->FP004[Inform the user of the optional vehicle model based on the returned is_form, \nand confirm whether he/she wants to choose this one]\nFP004--Confirmed to choose-->FP006>Current goal: Determine whether the order is successful\nDescription: The user places an order. \nCall taxiService according to the vehicle model selected, \nand determine whether the order is successful based on the returned is_ticket.]\nFP004--Not confirmed to choose-->FP005[Advise the user to consider before making a decision]\nFP006--Order is successful -->FP007[Current goal: Let the user leave a review\nDescription: Invite the user to rate services,\nask if he/she is satisfied or dissatisfied.]\nFP006--Order is unsuccessful-->FP008[Inform reasons for the failure based on the returned is_reason]\nFP007--Satisfied-->FP009[Thanks for choosing our service]\nFP007--Dissatisfied-->FP010[Current goal: Explain that more efforts will be made\nDescription: Inform that improvements will be made,\nstrive to satisfy the user next time]\n\nThe auxiliary parameter information in the workflow is as follows:\n\"free_time\": \"用户的空闲时间,格式为“年+月+日”,例如“2050年7月28日“\""
    },
    "cc734648-5ba6-4039-b357-c57b7495693e": {
        "domain": "Travel&Transportation",
        "role": "driving_service",
        "scenario_name": "Cancel driving appointments",
        "workflow": "：\nflowchart TD\nDJ000(Start)--Cancel appointments of substitute driving-->DJ001>Subgoal: Determine if the reservation information can be found\nDescription: Ask the user for the reservation information, \nincluding the ID number and the specific time of the appointment. \nCall getReservation to query. \nDetermine whether the corresponding reservation information can be found\nbased on the returned is_founding.]\nDJ001--Reservation information can not be found-->DJ002[Current goal: Inquire the user to make an appointment or look it up again\nDescription: Tell that the corresponding appointment information was not found. \nThe information can only be found after making an appointment. \nAsk if the user wants to make an appointment or look it up again]\nDJ002--Make an appointment-->DJ003[The user will be informed later by a dedicated staff member on how to make an appointment]\nDJ002--Look up again-->DJ001\nDJ002--Neither is carried out-->DJ004[Current goal: Say goodbye to the user\nDescription: Inform that the user is welcome to consult again if there are any needs. \nThen say goodbye to the user]\nDJ001--Reservation information can be found-->DJ007[Inquire if the user is sure to cancel the appointment]\nDJ007--Not sure-->DJ009[Advise the user to consider carefully]\nDJ007--Sure-->DJ005>Current goal: Call the API to determine whether the cancellation is successful\nDescription: Call cancelReservation and\njudge if the cancellation is successful based on the returned is_quit]\nDJ005--Cancellation is successful-->DJ006[Inform the user that the cancellation was successful]\nDJ005--Cancellation is unsuccessful-->DJ008[Tell the user of the reason for the unsuccessful cancellation based on the returned is_reason]"
    },
    "00eb0b19-2092-48a3-811c-530f52171e8f": {
        "domain": "Travel&Transportation",
        "role": "driving_service",
        "scenario_name": "Change surrogate driving reservation",
        "workflow": "：\nflowchart TD\nLA000(Start)--Change surrogate driving reservation-->LA001>Current goal: Determine whether the reservation information can be found.\nDescription: Ask the user for appointment information that\nincludes ID number and specific time of reservation.\nCall findReservation to make a query, \nand determine whether the corresponding reservation information can be found\nbased on the returned is_finding]\nLA001--Information can not be found-->LA002[Current goal: Inform that the information was not found\nDescription: Inform the user that the reservation information could not be found, \nand advise that the reservation information can only be found if an appointment is made, \nand ask the user if they need to look it up again]\nLA002--Needed-->LA001\nLA001--Information can be found-->LA003[Current goal: Ask the user if he/she wants to change information\nDescription: Inform the user that the reservation information has been successfully found.\nAsk if the user confirms that he/she wants to change it]\nLA003--Confirmed to change-->LA005>Current goal: Determine if the change is successful\nDescription: Ask the user for the origin and destination that need to be changed,\nand call changeReservation to determine if the change was successful based on the returned is_success]\nLA003--Not confirmed to change-->LA004[Ask the user to think it over before telling us]\nLA005--Change is successful-->LA006[Inform the user that the change has been successful]\nLA005--Change is unsuccessful-->LA007[Current goal: Ask the user whether to change again\nDescription: Tell the user that the change is unsuccessful,\nand inform the user of the reason why the change was not successful \nbased on the returned main_reason.\nAsk the user whether to change the information again]\nLA007--NO-->LA008[Say goodbye to the user]\nLA007--Yes-->LA005\nLA002--Not needed-->LA008"
    },
    "ca37c286-01eb-481c-8b63-5bebd28fad75": {
        "domain": "Travel&Transportation",
        "role": "ride_service",
        "scenario_name": "Initiate a ride order",
        "workflow": "：\nflowchart TD\nGZ000(Start)--Book a ride-->GZ001>Subgoal: Confirm suitable ride availability \nDescription: Inquire about the user's name, drop-off destination, and ride time,\ncall searchAvailableRides,\nand confirm suitable ride availability based on the returned rides]\nGZ001--Rides available-->GZ002[Subgoal: Confirm the selection\nDescription: Present available rides to the user and inquire about a selection based on the returned vehicle_type.\nThe user is required to confirm the selection of this type after the user's selection]\nGZ002--User confirms the selection-->GZ003>Subgoal: Ask for rating\nDescription: Call confirmBooking to make a reservation for a ride, \nprovide booking details to the user based on the returned booking_confirmation,\nand ask for an evaluation of this service. \nCriteria are categorized as excellent, good, fair, or very poor for the user to choose]\nGZ002--User not confirm the selection-->GZ004[Inform the user that the selection cannot be changed once it has been confirmed.\nThe user is required to think carefully before replying]\nGZ003--Excellent-->GZ005[Subgoal: Express gratitude\nDescription: Express gratitude to the user, and sustained efforts will be made to improve services and \nmaintain a good service attitude to be worthy of the high praise]\nGZ003--Good or fair or very poor-->GZ006[Thanks for the user's comments, \nand notify the user that sustained efforts will be made to provide satisfying service next time]\nGZ003--No review-->GZ007[Apologize to the user and say goodbye]\nGZ001--No rides available-->GZ008[Subgoal: Invite the user to reselect\nDescription: Tell the user that no suitable rides are available based on the given information.\nThe user is invited to re-supply the user's name, drop-off destination, and ride time to confirm again]\nGZ008--Yes-->GZ001\nGZ008--NO-->GZ007"
    },
    "79c7091b-cc86-46d8-8542-4ec75e882600": {
        "domain": "Travel&Transportation",
        "role": "ride_service",
        "scenario_name": "Initiate a ride change order",
        "workflow": "：\nflowchart TD\nHF000(Start)--Ride change-->HF001>Subgoal: Confirm changes availability \nDescription: Ask for the number of people transferring, boarding time, and boarding location,\ncall lookTransferVehicle and confirm  if changes are possible based on the returned vehicle_info]\nHF001--Change possible-->HF006[Inform the user of currently available changes based on the returned vehicle_info, and ask if the user selects one?]\nHF006--User selects one -->HF005[Notify user that the reservation is successful, and collect parameter: use_phone. The user will receive a call when the car is about to arrive]\nHF006--User does not select-->HF002[Ask if the user needs to change requirements?]\nHF002--Change confirmed-->HF001\nHF002--User does not change-->HF004\nHF001--Change not possible-->HF003[Subgoal:  Invitation to re-supply the information\nDescription: Inform the user that  there are no suitable changes based on the given information and the search for appropriate information.\nThe user is invited to re-supply the number of people transferring, boarding time, and boarding location to confirm again]\nHF003--NO-->HF004[Subgoal: Apologize to the user\nDescription: Apologize to the user for the few cars and difficulty in hailing rides, and thank the user for choosing this service.\nThe user is recommended to contact again in half an hour if necessary.]\nHF003--Yes-->HF001\n\nThe auxiliary parameter information in the workflow is as follows:\n\"use_phone\": \"The user\\\"s phone number contains 13 digits\""
    }
}