{
    "accc3823-7800-49bb-91b1-1189946dcb0b": {
        "domain": "Customer Service",
        "role": "apartment_manager",
        "scenario_name": "Search for apartments",
        "workflow": "The process starts with searching for apartments based on the user's specific needs, such as the number of bedrooms, price range, floor preference, and whether an elevator is desired. If no matching apartments are available, the user is informed and asked if they wish to modify their criteria. If they choose not to, they are apologized to for the lack of suitable apartments. However, if an apartment is available and the user is informed but not satisfied, they can choose either to view the apartment or inquire about other apartments. Should they wish to know about other options, the search restarts. If the user is satisfied with the apartment details, they decide whether to rent it immediately or view it first. If they opt to rent, the process checks if the rental is successful; if not, it may be due to issues like an unpaid deposit. In such a case, the user is informed about the failure and the possible reasons. If the user wants to view the apartment first, they are informed that the viewing process is being confirmed, indicating a wait time before the next steps can be taken. This flow ensures users are guided through their apartment search, offering options to adjust preferences, view apartments, or proceed with rental based on their satisfaction and the availability of suitable options."
    },
    "a33a0c30-08a6-4aca-9b53-30c2a86bbb87": {
        "domain": "Customer Service",
        "role": "apartment_manager",
        "scenario_name": "Make an appointment to view a home",
        "workflow": "The flowchart describes a process that begins when someone wants to view an apartment. If the user hasn't found a satisfactory flat, they search for an apartment, schedule a viewing, and proceed through the flow. If they have a preferred apartment, the room information is verified through a call to 'getRoomInfo' to ensure the details are correct and the room code isn't empty. If there's no desired room number or the parameters are empty, the search process restarts. Upon confirming the room number, the next step is to confirm viewing times with 'fixTime'. If no viewing times are available, the user is asked to either reschedule, look at another apartment, or wait to view the apartment later. If a suitable viewing time is found, the user is asked to provide their viewing time and phone number, ensuring they arrive at the community gate on time, where a salesman will meet them. This process ensures both the verification of apartment details and the scheduling of a viewing, facilitating a smooth experience for potential renters."
    },
    "daa55e31-92ff-409f-8222-847fe8db90ac": {
        "domain": "Customer Service",
        "role": "apartment_manager",
        "scenario_name": "Apartment fee payment",
        "workflow": "The flowchart describes a process for apartment fee payment which begins with determining the user's identity by asking for their phone number. If the user is not recognized as a resident, they are given a chance to provide their phone number again or exit the process. If identified as a resident, they are informed about their fee and asked if they want to pay now or later. Choosing to pay now moves the process to check if the fee has been fully paid, with reminders sent if the payment is incomplete. If the fee is fully paid, or if the user chooses to pay later, they are advised to complete payment as soon as possible, and the process ends with a farewell to the user. This summary encapsulates the user journey from identification through to payment completion, emphasizing the steps taken to ensure the user is a resident and the options provided for fee payment."
    },
    "68cc0227-0585-4b7b-9982-cfb360cf97f3": {
        "domain": "Customer Service",
        "role": "apartment_manager",
        "scenario_name": "Apartment fee bill inquiry",
        "workflow": "The process begins with an inquiry into an apartment fee bill, aiming first to confirm the user's identity by asking for their phone number. This step involves a procedure called confirmationIdentity to verify the user's details. If the user's information is successfully identified, the process advances to determine if the billing information for a specified date can be retrieved. Should the billing information be available, the user is notified of their billing details. However, if the billing data cannot be found, perhaps due to an unpaid apartment fee, the user is prompted to decide whether they want to try another date. Should the user's information not be found initially, indicating they might not reside in the apartment or have provided an incorrect phone number, they are asked if they wish to supply a different phone number. If the user agrees to provide another number, the identification process is attempted again. Conversely, if the user decides against providing a new number or if billing information remains undiscoverable even after changing the date, the process concludes by notifying the user that the inquiry cannot be completed. This flowchart outlines a straightforward yet detailed procedure for handling apartment fee bill inquiries, emphasizing identity confirmation and the retrieval of specific billing information."
    },
    "b7bb32bf-0d2b-4428-8234-b8c61a266740": {
        "domain": "Logistics Solutions",
        "role": "moving_service",
        "scenario_name": "Moving Service Appointment",
        "workflow": "The flowchart describes a process for booking a moving service, beginning with asking the customer if the move is within the same city. If yes, the customer is then asked if they accept the moving fee, which is determined after the moving information (origin and destination) is collected and the fee is calculated. If the customer accepts the fee, they are asked about their preferred moving time. If this time is feasible, the service is confirmed for that time. However, if the move is not within the same city, the customer is informed that only same-city services are provided, and they are asked if they want to change their request to fit this criterion. If they do not wish to change or do not accept the moving fee, the process ends. If the preferred moving time is not feasible, the customer is asked to choose another time. This process ensures that the service is efficiently booked according to the customer's needs and the company's capabilities, concluding with either a scheduled move or informing the customer if their needs cannot be met."
    },
    "9bf56f1e-d44b-4728-84f1-0e61209b2a89": {
        "domain": "Logistics Solutions",
        "role": "moving_service",
        "scenario_name": "Insurance claim",
        "workflow": "The process begins with a property claim where the initial step involves calling an API to determine if the property's insurance is still valid by checking if it's past its expiration date. This involves asking the user for details about the damaged or lost property and using the verifyInsurance function to check validity. If the insurance is invalid, the user is informed that compensation cannot be provided. If it's valid, it's then checked whether the damaged or lost property falls under the insurance coverage. If the property is covered, another API is called to decide if the audit for compensation passes. If the audit passes, the user is informed about the compensation amount, which will be delivered in three days. If the audit does not pass, the user is asked if they wish to readjust their claim. If readjustment is needed, the process loops back to the initial API call; if not, the user is apologized to for the inconvenience. On the other hand, if the property is not covered by insurance, the user is informed that the property is not eligible for compensation."
    },
    "303519f3-9d93-4a47-b23e-e31ed7153757": {
        "domain": "Customer Service",
        "role": "gas_equipment_service",
        "scenario_name": "Gas repairs",
        "workflow": "The flowchart describes a gas maintenance process starting with an inquiry about the maintenance location. If the maintenance is needed within the homeowner's meter area, it's considered the user's responsibility, and they are informed about self-maintenance options including doing it themselves, choosing third-party maintenance, or requesting the company's services. If the user opts for the company's maintenance, 'ContactMaster' is used to arrange a technician visit, while for third-party maintenance, the user is advised to independently find a technician, followed by a company inspection after seven days. In case the user is unavailable for the inspection, a preferred day for the maintenance check is scheduled. If the maintenance is needed outside and including the homeowner's meter area, it is the company's responsibility, and a technician is sent directly. This process ensures clarity on responsibility and options for gas maintenance for both within and outside the homeowner’s meter area."
    },
    "71395c1c-1e1a-46d9-90be-08424c7dfe76": {
        "domain": "Customer Service",
        "role": "gas_equipment_service",
        "scenario_name": "Gas fee inquiry and payment",
        "workflow": "The flowchart outlines a process for handling gas service inquiries, which includes two main paths: gas fee inquiry and gas bill payment. Initially, the process starts with a gas fee inquiry where the system checks gas bills by calling the \"lookMeter\" function to query the gas cost. If the query is successful (i.e., \"is_success\" returns true), the system then informs the user about their remaining balance and asks if they need a detailed list of expenses. If the user requests a specific list, the system inquires which months are needed and provides a detailed expense list. Alternatively, if the user doesn't need a detailed list, the process ends with a thank you message.\n\nFor gas bill payments, the system obtains a payment link by calling the \"getPayLink\" function and requesting user information. If the acquisition is successful, the system checks if the user has already paid. If the payment has been made, it suggests checking whether the gas balance has been updated; if not, it instructs the user to complete the payment within 10 minutes. Should the query for either gas fee inquiry or payment link acquisition fail (due to incorrect user information, for example), the user is prompted to re-enter their information. This concise description encapsulates the process's efficiency in handling user inquiries and payments related to gas services."
    },
    "334e3f27-1c0f-4d66-8869-acb64a86439c": {
        "domain": "Customer Service",
        "role": "gas_equipment_service",
        "scenario_name": "Feedback on Gas Service Interruption",
        "workflow": "The process starts with receiving feedback about a gas outage, followed by confirming the user's account information by calling the 'lookMeter' function to query the user's gas charge status. If the query is unsuccessful (is_success is false), the user is asked to re-enter their information. Once the query is successful, the system checks if the user has a sufficient balance. If the balance is sufficient, it then checks for any announcements. If there is an announcement, the user is informed about it and advised to use non-gas-dependent equipment temporarily. If there is no announcement, the system checks if gas is available in the surrounding area. If gas is available, it suggests a possible device malfunction and the need for repair. If gas is not available, it speculates possible reasons for the outage, such as maintenance or a broken main meter, and advises contacting the property management. If the initial check reveals an insufficient balance, the user is informed that they need to pay their bill to resolve the gas outage issue. This entire process ensures efficient troubleshooting based on the user's account status, balance, and external factors affecting gas supply."
    },
    "d2fe7ddc-c35f-4d5c-a2cc-a4a2c6496049": {
        "domain": "Robotic Process Automation",
        "role": "workstation_applicant",
        "scenario_name": "Replacement of workstations",
        "workflow": "The process begins when there is a need to change a workstation. First, the system asks for the user's identity by calling the getUserInfo function and checks if the response (back_code) matches the correct identity. If the identity is correct, it then checks if the user has already determined a workstation. If the identity is incorrect, the system apologizes and rejects the request for a workstation change. For users with a defined workstation, the system verifies it by calling verificationStation. If the verification returns true, the system proceeds to fill out an application form and informs the user of the success or failure of the application based on the is_success response. A successful application results in the user being told that the workstation will change the next day, while an unsuccessful one prompts a notification of failure. If the workstation is undefined or the verification returns false, the system either provides feasible workstation options by calling recommendedStation or asks the user to re-select a workstation. Users can then decide to continue with the change or not. If they decide not to change the workstation, the process ends with a goodbye to the user. If they continue, the process loops back to verifying the new or provided workstation."
    },
    "079403cb-e17b-4d96-bbf9-60c7a5582235": {
        "domain": "Robotic Process Automation",
        "role": "workstation_applicant",
        "scenario_name": "Request the user to change the workstation",
        "workflow": "The flowchart describes a process beginning with a start point where a user is requested to change their workstation. It progresses to asking the user for their identity, where the system uses getUserInfo to verify the user's identity. If the identity is correct, the system proceeds to obtain application results via obtainApplicationResults, checking if the application is passed or not. If the application is approved, the user is asked if they want to proceed with changing the workstation. If the user decides against changing the workstation, they must provide reasons for this decision. Conversely, if the user wants to change the workstation, they are reminded to do so before a specified deadline, informed by the deskChange function. Should the application be rejected, the user is notified of the failure and the reason behind it, with an invitation to reapply. If at any point the user's identity cannot be correctly verified, the system informs the user of the mistaken identity and rejects the workstation change request. This process involves various parameters, such as \"no_change_reason\" for not changing the workstation and utilizes API information for operations like obtaining user identity and application results."
    },
    "2a3d66de-3a03-428b-ae61-8c5ef7ee6f22": {
        "domain": "Logistics Solutions",
        "role": "food_delivery_service",
        "scenario_name": "Online surveys",
        "workflow": "The process begins with initiating a survey where the first step is to confirm if the person on the call is Mr. Wang Zhenyan. If the answer is no, the caller apologizes for the wrong call and informs the person about the mistake. However, if the answer is yes, meaning the caller is indeed speaking with Mr. Wang, who is a regular customer of Mr. Rice, the next step is to ask Mr. Wang if he has time to participate in a satisfaction survey. If Mr. Wang is willing to participate, the survey progresses to inquire about his satisfaction with the service provided. Depending on his response, if he is satisfied, the caller thanks Mr. Wang for his high evaluation and assures the continuation of good service. Conversely, if Mr. Wang is unsatisfied, the caller pledges to improve the services and apologizes for any inconvenience. If Mr. Wang is unwilling to participate in the survey at the moment, the caller then inquires if he could indicate a more convenient time for him. If Mr. Wang can provide a suitable time, the caller takes note of this and informs him that a call will be made during that time slot. If he cannot provide a time, the caller simply apologizes and ends the call."
    },
    "fb31b7e3-1303-45d7-8359-cba9208cb2eb": {
        "domain": "Logistics Solutions",
        "role": "food_delivery_service",
        "scenario_name": "Get Food Voucher",
        "workflow": "The process begins by confirming whether the callee is Mr. Wang Zhenyan. If the answer is no, the caller apologizes and explains it is a wrong call, and the flow ends. If the answer is yes, the caller (Mr. Rice) introduces a current promotion in which all dishes are 6% off, and asks whether Mr. Wang has time to come.\n\nIf Mr. Wang does not have time, he is informed that the promotion starts next Monday and ends next Sunday, and he is invited again to see whether that window works. If he still has no time, the caller apologizes and ends the conversation.\n\nIf Mr. Wang does have time—either immediately or after hearing the promotion window—the caller asks whether he needs an appointment. Choosing no appointment means he can queue on arrival to participate in the promotion. Choosing appointment leads to a choice of making the appointment now or later. If he prefers to make it later, he is reminded to contact the restaurant by the following Monday to arrange it.\n\nIf he chooses to make the appointment now, the caller collects the user’s ID number and name and calls the userReservation API. If the API returns success, the caller confirms the appointment with Mr. Wang. If the API returns failure, the caller explains that the appointment did not succeed—possibly due to errors in the ID number or name—and asks Mr. Wang to re-provide the ID and name so the reservation can be retried. This flow ensures the callee is correctly identified, confirms availability during the promotion window, and offers a streamlined appointment option that skips queuing for those who schedule in advance."
    },
    "a30c11b7-ec42-4020-aa11-87ce92f50518": {
        "domain": "Personal Assistant",
        "role": "meeting_arrangement",
        "scenario_name": "Launch the meeting",
        "workflow": "This flowchart outlines a process for managing meeting schedules and notifications. Initially, it starts with launching the meeting process where it checks if the meeting can be scheduled by asking the user for meeting details and calling a function named `scheduleMeeting`. If the meeting is feasible, the user is notified that the meeting is set, and a text message is sent. The user is then asked if they need a meeting link and whether they want a reminder. If a reminder is desired, the user specifies a contact time, and they are informed that a reminder will be sent in advance. If no reminder is needed, the user is encouraged to join the meeting on time. However, if the meeting cannot be scheduled, the user is informed why it's not possible and asked if they want to adjust the meeting details or force the meeting to start. Forcing the meeting to start calls `scheduleMeeting` again to set up the meeting forcibly. If a meeting link is not needed initially, one is provided for user access. The process is designed to ensure smooth communication and scheduling for meetings, accommodating user needs for reminders and meeting adjustments as necessary."
    },
    "23e2583a-74c5-4caa-8137-6d0dca3506fe": {
        "domain": "Personal Assistant",
        "role": "meeting_arrangement",
        "scenario_name": "Cancel meeting",
        "workflow": "The flowchart describes the process for canceling a DingTalk meeting. Initially, it checks if the meeting has started by calling `inspectionMeeting`. If the meeting has started, it then checks if the meeting can be canceled. If it cannot be canceled, it determines whether the issue is due to mobile phone problems or network issues. For mobile phone issues, it suggests the user try using a computer, explaining that compatibility or bugs in the mobile DingTalk app might prevent meeting cancellation. For network problems, it recommends checking the network connection or switching networks before attempting to cancel again. If the meeting hasn't started, it guides the user to cancel the meeting through the DingTalk home page. If cancellation is possible, it asks for confirmation from the user, highlighting that cancellation is irreversible. If the user hesitates, it suggests taking more time to decide. Upon confirmation, it checks if the user is the meeting host; if so, the host can cancel the meeting. If not, the user is advised to consult with the host about canceling the meeting. This process ensures that meetings are only canceled when appropriate and that users are aware of the consequences and technical requirements for cancellation."
    },
    "118f7450-5f7a-499b-82f3-c05f25d3a42b": {
        "domain": "Travel&Transportation",
        "role": "flight_inquiry",
        "scenario_name": "Check flights",
        "workflow": "The process described in the flowchart starts with checking for flights. First, it inquires the user for their departure city and date, then calls the planeSearch function to confirm if flight information can be found based on the returned plan_dict. If no information is found, the user is informed that there are no available flights on the selected route and is asked to reselect. This loop continues until a suitable flight is found. Once a flight is identified, the user is notified, a list of found flights is displayed based on plan_dict, and the user is asked for their flight preference. If the user selects a preferred flight, they are then asked for the flight ID, and the flight price is provided based on the returned plan_price. If the user does not prefer any flights, they are asked if they want to continue searching. If they choose to continue, the process loops back to inquiring for departure city and date. If they choose not to continue, the process ends with a goodbye message, always welcoming the user to inquire in the future."
    },
    "a7bb4821-c848-4593-a520-694190df31a0": {
        "domain": "Travel&Transportation",
        "role": "flight_inquiry",
        "scenario_name": "Book a flight",
        "workflow": "The process begins with the start of booking a flight, where the system inquires the user for the Flight ID. It then calls a function to check the availability of the flight and confirms if the flight is available. If the flight is available, the system will inform the user and then ask for the user's ID number and name to proceed with reserving the flight. It checks if the reservation is successful based on the feedback received. If the reservation succeeds, the user is informed about the success and provided with the booking details. The system then asks if the user wishes to book another flight. If the reservation fails, the user is notified about the failure and also asked if they want to try booking again. Should the flight initially inquired about be unavailable, the user is informed, and the system checks if they want to book a different flight. If the user decides to book again, whether after a failure, success, or upon finding out their initial choice is unavailable, the process loops back to asking for flight details. If at any point the user decides not to rebook, they are welcomed to contact again for future needs. This process ensures that the user is guided through each step of booking, with clear outcomes for every scenario, including successful booking, failed booking, or the flight being unavailable."
    },
    "682b15cd-fb08-4ec6-b8be-3620033aa040": {
        "domain": "Logistics Solutions",
        "role": "express_support",
        "scenario_name": "Express shipping",
        "workflow": "The process begins with the start of sending a courier, where the first step involves gathering necessary information from the user, including the sender's and recipient's names, telephone numbers, and addresses. This information is then used to determine if the shipment can proceed. If the mail cannot be sent due to incorrect information, the user is informed and given the option to either correct the information or cancel the shipment. If the user decides to cancel, they are bid farewell. Conversely, if the shipment meets the requirements, the user is asked to confirm the information, with a stern reminder that no changes can be made post-confirmation. Should the user choose not to modify the information, the process advances to providing the user with a tracking number and asking if they wish to continue with the shipping. If the answer is no, the process ends with a farewell to the user. However, if the user wishes to proceed or decides to change the information at any point when prompted, the flow loops back to the information gathering stage to reassess the possibility of shipping based on the updated details, ensuring the user is always informed and in control of the shipping process."
    },
    "7795cb1c-ed92-476b-9a18-9701645e5da9": {
        "domain": "Logistics Solutions",
        "role": "express_support",
        "scenario_name": "Query express information",
        "workflow": "The flowchart describes a customer service process for handling express delivery inquiries. The process begins with asking the user for their order number to look up their shipment details. If the order is not found, the user is prompted to re-provide the order number, possibly due to a mistake in the initial entry. Once the order is found, the user is informed about the status of their delivery. If the item has not been delivered, the user can choose to either urge the logistics for faster delivery or check the current location of their order. If the item has been delivered, the user is asked whether they have received it. If they haven't, they're advised to check the nearby Cainiao Station for pickup. If the delivery has been received, the user's satisfaction with the express service is queried. Unsatisfied users are reassured that efforts will be improved for future satisfaction, while satisfied users are thanked for their positive feedback. This process ensures efficient tracking and resolution of delivery inquiries, enhancing customer satisfaction with the express service."
    },
    "0b866d96-bf17-45c4-ae4e-dbc2b1f5898b": {
        "domain": "E-tailing Recommandation",
        "role": "computer_store_sales",
        "scenario_name": "Notebook purchase",
        "workflow": "The process begins with recommending a notebook and asking the buyer if they have a favorite brand from the options available: Honor, Xiaomi, and Asus. If the buyer doesn't have a preference, they are informed about the advantages of these brands, which include being lightweight, easy to carry, and high performance. If the buyer is willing to consider these options, a specific notebook recommendation is made. If not, an apology is extended for not being able to recommend a suitable notebook. If the buyer has a favorite brand, a notebook from that brand is recommended. If the buyer is not satisfied with the recommendation, another brand is suggested until satisfaction is achieved. Upon satisfaction, the buyer's preferences for screen size, color, and memory capacity are asked for, and the price of the recommended notebook is provided. If the buyer decides to purchase, they are reminded to make the payment through a shared link. If the buyer chooses not to buy, they are encouraged to think it over. This process ensures the buyer is guided through selecting a notebook that meets their preferences and needs, with options for reconsideration at each step."
    },
    "05623f8a-c038-436f-8a15-7912f0d84651": {
        "domain": "E-tailing Recommandation",
        "role": "computer_store_sales",
        "scenario_name": "Laptop Returns",
        "workflow": "The flowchart outlines a process for handling laptop returns, starting with asking the user if the return is due to quality issues or simply because they changed their mind within a seven-day period. If the return is due to quality problems, the process involves calling an API to advise the user on how to address the issue by asking about the laptop model and specific problem, providing a solution, and checking if the problem is resolved. If not, the user is given technician contact information for further assistance. If the problem still persists, the possibility of a return is evaluated. If the return conditions are not met, the user is informed that a return is not possible. However, if a return is feasible, the user is instructed to bring the laptop to the store for inspection and potential return. On the other hand, if the return is within seven days for no specific reason, the user is asked if the laptop is well-packed. If yes, the return is processed; if not, the user is informed that the laptop cannot be returned unless the packaging is in good condition. This process ensures that returns due to quality issues are handled efficiently while also accommodating returns for other reasons within a specified timeframe."
    },
    "6f586cef-ec6f-4b7b-a005-30f535f48283": {
        "domain": "Robotic Process Automation",
        "role": "mail_administration",
        "scenario_name": "Send mail",
        "workflow": "The process begins with sending an email, where the first step involves determining if the user has an email account by asking for their ID number and preferred email address. If the user has an account, the process moves on to judge if the recipient's email address is valid. Should the recipient's address be invalid, the user is informed and can choose to provide a different address or end the process. If willing to try again and a valid address is provided, the user is then asked if they wish to send the email immediately or later. Choosing to send it immediately triggers the email's dispatch, while opting to send it later gives the user the option to save the email content in the draft box for future use or not use the draft box at all, ending the process. If initially found without an email account, the user is advised to register for one before they can send emails. This entire flow encapsulates a user-friendly email management system that verifies user accounts, validates recipient addresses, offers draft saving options, and requires registration for account-less users, all aimed at facilitating smooth email communication."
    },
    "7b1fb560-7939-4bb1-8039-0f037fd5de4a": {
        "domain": "Robotic Process Automation",
        "role": "mail_administration",
        "scenario_name": "Reply to an email",
        "workflow": "The process starts with responding to an email by first determining if the user has an email account by asking for their ID number and the email address they wish to use. If the account exists, the next step is to figure out if the specific email can be found by asking for details like the sender and the time the email was sent. If the account does not exist, the user is informed that they need to register for an email account before proceeding. In the event the email cannot be found, the user is asked if they can provide the email information again. If they cannot, they are informed that the email couldn’t be found. If the email is found, the process moves on to inquire if the user wants to reply immediately or later. Choosing to reply immediately leads to assisting the user in sending the reply and informing them of the successful action. If the user decides to reply later, they are advised to contact support whenever they need to respond to an email. This flow ensures that a user is guided through the steps of email account verification, email search, and responding to emails systematically."
    },
    "c311d9c6-7a0e-4569-ba54-bf1d273f10dd": {
        "domain": "Personal Assistant",
        "role": "financial_assistant",
        "scenario_name": "Currency exchange",
        "workflow": "The flowchart describes a process that starts with determining whether a user wants to know about the exchange rate or convert currency directly. If the user opts to know the exchange rate, a function called acquisitionRate is called to provide the user with the current exchange rates. On the other hand, if the user wishes to exchange currency directly, another function, exchangeMoney, is invoked to perform the currency exchange. The success of this operation is then checked. If the exchange is successful, the user is instructed to check their account for the exchanged currency. If not successful, the process determines the cause of the failure, which could be due to having no exchange times left for the year, exceeding the foreign exchange limit, or having an insufficient balance. Depending on the cause, the user is advised accordingly, either to visit the counter of the People's Bank of China for more exchanges or applying for exceeding the limit, or to check their balance if it's insufficient."
    },
    "f40d5a18-9483-49d1-8d1e-539223773893": {
        "domain": "Personal Assistant",
        "role": "financial_assistant",
        "scenario_name": "Appointments for large withdrawals",
        "workflow": "The process starts with scheduling a withdrawal where the user needs to confirm the withdrawal amount. If it's 20,000 RMB or less, the withdrawal can be completed directly at an ATM without the need for an appointment. However, for amounts exceeding 20,000 RMB, an appointment is necessary. The user is then guided on how to find an ATM, which are generally located in each outlet and can be found using map software or by asking live customer service. The ATM supports withdrawals throughout the day as long as it has money, with a maximum of 5,000 RMB per transaction and a daily limit of 4 transactions, totaling a maximum of 20,000 RMB per day. If a reservation is made for a larger amount, the user’s identity is verified. Upon successful verification, the user must inform their withdrawal intention. If the intention is approved, the user can confirm the reservation details such as the withdrawal amount. After making a reservation, the user is reminded to withdraw the money at the reserved bank on the specified day with their bank card and ID card. If the reservation process fails, the user is informed of the reasons for failure and advised to check their account balance or visit bank outlets for further assistance."
    },
    "e27d36bc-1b76-464f-bbed-c5dbc39dda07": {
        "domain": "Personal Assistant",
        "role": "financial_assistant",
        "scenario_name": "Check the balance and transfer the bank card account",
        "workflow": "The process begins with handling banking services where the system asks for the user's ID number and bank card account number to check the availability of the user's bank account. If the account is found, the user is informed about their bank balance and asked if they have any questions about it. If the user has questions, they are informed about the last five transactions on the bank card. If the user has no further questions or after addressing their inquiries, they are asked if they need any other services. If no bank account is found, the user is asked to re-provide their information due to possible errors, and if they choose not to, the process ends with a goodbye. If other services are needed, the user can choose to apply for a bank card or transfer a bank card account. For a new bank card application, the user is guided through an online process that includes filling out an application form with personal and card details. The application is then processed, and if it fails, the user is asked to check their details and submit again. If the application succeeds, the user is asked for an address to send the card to, which will be mailed. For bank card account transfer, the user is instructed to use the bank's mobile app to change their password through the security center."
    },
    "095a5a47-659f-4725-a029-83883f642982": {
        "domain": "Personal Assistant",
        "role": "medical_consultant",
        "scenario_name": "Make an appointment with a doctor",
        "workflow": "The described process begins with the initiation of an appointment with a doctor, where it's first assessed if the user knows their desired doctor, the appointment time, and the doctor's availability. If the user is unaware of the doctor's availability, a function, JudgeDoctorSTime, is called to confirm the doctor's availability at the scheduled time. Should the doctor be available, the user is informed and asked whether they wish to proceed with the appointment or look for another doctor. If opting to look for another doctor, the process loops back to confirming the doctor's availability. If the user has no specific doctor in mind, a function, findDoctor, is invoked to list all available doctors in the relevant department at the scheduled time. On the other hand, if the user knows all necessary details, an appointmentRegister function is triggered to finalize the appointment at the designated time. This function also handles the scenario of appointment confirmation, requiring users to arrive 15 minutes early for a registration fee, or it provides reasons for a failed appointment registration based on the response it returns. In situations where the initially chosen doctor is unavailable, the user is prompted to select another doctor, ensuring flexibility in appointment scheduling."
    },
    "12233102-ba1a-4302-b284-05428cc3547f": {
        "domain": "Personal Assistant",
        "role": "medical_consultant",
        "scenario_name": "Get diagnostic results",
        "workflow": "The process begins with asking about the diagnosis and requesting user information, followed by calling a function to check the medical progress and confirm whether the doctor has issued a diagnosis. If the doctor hasn't issued a diagnosis yet, the user is notified to wait and possibly contact the doctor for another appointment if the wait is too long. If a diagnosis has been issued, the user is informed and asked if they need medication, hospitalization, or no treatment. For those needing medication, information is provided, and the user can choose a quick purchase using their bound account or pay at the hospital if their account isn't set up or lacks funds. If hospitalization is needed, the user is directed to the corresponding department's front desk for further instructions. Users who don't need treatment are reassured and advised they can seek a second opinion or psychological consultation if they have doubts."
    },
    "1bf1ee30-d926-43fd-809f-7403004348ae": {
        "domain": "Customer Service",
        "role": "restaurant_waiter",
        "scenario_name": "Find a restaurant",
        "workflow": "The process described begins with the search for a restaurant, where the user is asked about their location, cuisine preference, and dining time. Based on this information, a function called searchRestaurant is called to find suitable restaurants. If no restaurants match the criteria, the user is notified and asked if they would like to search again. If the user decides not to search again, they are apologized to and the process ends. When a restaurant is found, the user is informed, shown a list of restaurants with details, and asked if they are satisfied with the options. If the user is not satisfied, they are notified that other recommendations are available and asked if they would like to see them. If the user is satisfied, they are told the restaurant's location and encouraged to visit it. If at any point the user decides not to continue searching for other recommendations, they are apologized to and the process ends."
    },
    "31fe2a3e-ab57-49d3-b5c7-fdf85584a72b": {
        "domain": "Customer Service",
        "role": "restaurant_waiter",
        "scenario_name": "Book a restaurant",
        "workflow": "The process begins with the user attempting to book a restaurant. Initially, the user provides the restaurant name, the number of people, and the desired reservation time. This information is used to check if the restaurant can accommodate the reservation at the specified time. If the reservation is possible, the user is notified of the availability. They are then asked for contact information and any special requests, and an attempt is made to book the reservation. If the booking is successful, the user is informed that their reservation is confirmed along with the booking details, with a reminder that not arriving within 20 minutes of the reservation time will result in forfeiture of the reservation. However, if the reservation cannot be made either because the restaurant is fully booked at the desired time, the restaurant's name provided is incorrect, or the restaurant is closed at that time, the user is informed accordingly. If the reservation is not available, the user is asked if they would like to choose a different time. If they say no, the user is thanked for their understanding and asked if they want to try booking for a new time, or if the issue was due to incorrect restaurant information or closing times, they are invited to provide the details again for a new check. If the reservation attempt fails, possibly due to incorrect contact information, the user is asked to correct the information and try again. This process ensures multiple pathways to accommodate or rectify the user's booking request based on different scenarios of availability, user choice, and information accuracy."
    },
    "2dfe18d3-125b-4587-a2b6-03546ec751f0": {
        "domain": "E-tailing Recommandation",
        "role": "online_shopping_support",
        "scenario_name": "Search for products",
        "workflow": "The process described in the flowchart begins with the start of a product search, where the system inquires about the user's needs regarding product type, brand, price range, and other specifications. This information is used to search for products. If no suitable products are found, the user is informed and asked if they would like to adjust their requirements. If the user decides not to adjust their needs, they are apologized to for the inability to find suitable products. Conversely, if suitable products are located, the user is shown these products and asked if they are satisfied. Should the user be satisfied and willing to buy, the product is added to the shopping cart, and the user is informed of the successful addition. If the user decides not to buy, they are asked for their reasons, which are collected for feedback. Alternatively, if the user is not satisfied with the product options, they are encouraged to consider other items. The user can either agree to look at more products, leading them back to the initial product search phase, or decline, at which point they receive an apology for not finding suitable products. This process allows for adjustments in search criteria and aims to find products that meet the user's needs while also gathering feedback on reasons for not purchasing."
    },
    "a908ae8d-9758-4a3f-adaa-f0846a361775": {
        "domain": "E-tailing Recommandation",
        "role": "online_shopping_support",
        "scenario_name": "Shopping cart management",
        "workflow": "The processing flow begins with the management of the shopping cart where the system confirms the items in the cart by calling the function \"lookShopCart\" to retrieve cart information and informs the user of the cart's contents. Next, it asks the user if they wish to proceed to checkout, continue shopping, or modify the cart. If modification is chosen, the \"changeShopCart\" function is called to make changes; if an item model needs to be altered, it suggests deleting and repurchasing the item. The user is then updated on the cart's contents. If checkout is selected, the system inquires about the chosen products and, after double confirmation from the user, calls \"shopCartCheckout\" to finalize the purchase and informs the user of the due amount. It then asks whether the user prefers to pay using their account balance or a payment link. If the account balance is chosen but insufficient, the user is prompted to either use a payment link or informed of insufficient funds. Using the payment link involves calling \"linkPay\" to provide payment information and a link, checking for successful payment, and informing both the user and merchant about the payment status. If payment fails, the user is given a chance to complete the payment within 24 hours, or else the order is canceled. This flow ensures a flexible shopping experience, providing multiple points for decision-making and payment options, thus accommodating various user preferences and situations."
    },
    "35dbbd92-f9bc-4b4d-b21e-0e64fcff628a": {
        "domain": "E-tailing Recommandation",
        "role": "online_shopping_support",
        "scenario_name": "Order operations",
        "workflow": "The process begins with checking an order where the system retrieves brief order information through a function called lookOrders. If the user's account is normal, they are provided with rough order details; if not, they're asked to correct their account information. Following this, the system inquires if the user wishes to proceed with any specific order. If they do not, a farewell is extended. If they wish to proceed, the system asks which order they'd like to operate on and checks its current status. If the goods have been received, the user is informed and asked if they want to return the product. Should they decide not to return it, it's explained that only received orders can be returned. The system then inquires if there are any other orders the user wishes to operate on. If the goods have not been received, the user is asked whether they want to check order information, cancel the order, expedite it, or change the address. Choosing to check order information triggers a function to provide detailed order information. Opting not to check leads to an operation on the order with the result communicated to the user. This process loops back to asking if there are other orders to operate on until the user decides there are none, concluding the interaction."
    },
    "8173ea61-ee58-4213-abe2-a1fa14c160f0": {
        "domain": "Robotic Process Automation",
        "role": "printing_service",
        "scenario_name": "File printing",
        "workflow": "The process begins with printing documents, where it's crucial to confirm if the user has uploaded the files to the company's system. This step is important because files need to be uploaded and reviewed before printing to avoid printing documents that shouldn't be. If the files haven't been uploaded, the user is instructed to upload the files to the system and notify the staff after obtaining a file ID for auditing purposes. If the files are already uploaded, the next step is to confirm the number of copies needed and any specific requirements like color printing; otherwise, documents are printed in black and white, one copy by default. The system then schedules the print job based on the user's specifications. If the process encounters an error, indicating the file wasn't found or contains unprintable content, the user is informed about the issue and asked to double-check and re-upload the documents. Throughout this process, it's ensured that files are properly audited, and users are kept informed about the status of their printing requests and any issues encountered."
    },
    "594e07e2-4189-4655-9a42-a9e07c511629": {
        "domain": "Robotic Process Automation",
        "role": "printing_service",
        "scenario_name": "Notification of file results",
        "workflow": "The process begins with notifying the employee of the file result, where the first step is to confirm the employee's identity by asking for their name and employee number. This is checked by calling the `getEmployeeStatus` function, and if the identity is verified correctly, the employee is informed about the document printing result, and the process moves forward. However, if the identity is incorrect, an apology is issued to the user. Next, the process involves getting the print result of the file by calling `getPrintResults` to determine if the application was successful. If successful, the number of pages in the document is confirmed with the user to prevent information leakage. Depending on whether the user provides the correct number of pages, they are either asked how they wish to receive the file (pick up by themselves or delivered by staff) or informed about the failure to deliver the document due to inconsistency in the number of pages. If the user opts for picking up the document themselves, they are informed of the location and pickup number. If the delivery option is chosen, the user’s workstation location is collected to schedule the delivery, with a note that if no one is present at the workstation, delivery will not be made. If the application for printing was unsuccessful, the user is informed of the reason, which could be due to the file not meeting specifications or being too large, and they are advised to contact the person in charge for more details."
    },
    "22a5b4b4-0182-42d3-9069-f18f5e93239e": {
        "domain": "Travel&Transportation",
        "role": "travel_assistant",
        "scenario_name": "Travel guidance",
        "workflow": "The process begins with the initiation of a request for travel guidance, where the user is asked for information regarding their travel preferences such as mode of travel, departure and arrival points, and dates. This information is used to check for the availability of a suitable vehicle for the journey. If a vehicle is unavailable, the user is notified and asked to reselect their preferences. If a vehicle is available, details about the ride are shared with the user, including the option to accept the ride or not. If the user is not satisfied, they can choose to reselect their preferences. If the user decides to buy the ticket immediately, they are provided with a payment link and asked to complete the transaction. If the payment is not completed, the user is prompted to try the payment process again. Throughout this flow, if at any point the user decides to rethink their options or is unable to find a suitable ride, they are given the chance to reconsider their choices or are apologized to for not finding a suitable ride option. This flow ensures that the user is guided through the process of finding a travel option that suits their needs and completing the necessary steps to finalize their travel plans."
    },
    "f9da7809-38d8-43bb-b6fd-fd3cf110ada2": {
        "domain": "Travel&Transportation",
        "role": "travel_assistant",
        "scenario_name": "Weather services",
        "workflow": "The flowchart describes a process where the system starts by offering weather services to the user, asking if they want to check the weather or turn on weather reminders. If the user chooses to turn on weather reminders, they are informed about the availability of morning, evening, and unusual weather reminders. For unusual weather reminders, the user is told they will receive timely notifications about imminent changes in rainfall and air quality. If they opt for morning and evening reminders, they are notified that they will get weather news for today or tomorrow at 7:00 and 19:00 every day. On the other hand, if the user wants to check the weather, they are asked about the location and date. The system then attempts to find the corresponding weather data. If the weather data is available, the user is informed and shown the weather forecast, with an option to check another location or date. If no data is found, the user is informed that the data is not available and asked if they want to continue the search. The process loops as needed based on the user's desire to continue checking or not. The flowchart concludes with the system saying goodbye to the user if they decide not to continue any checks or if they are done with setting reminders."
    },
    "6727cdb8-f374-4db8-b59b-8f48f7ba0250": {
        "domain": "Customer Service",
        "role": "hotel_reception",
        "scenario_name": "Find a hotel",
        "workflow": "The flowchart describes a simplified process for searching and booking a hotel. Initially, the user is asked for their destination, dates, and preferences, and an API is called to find hotels that match these criteria. If no hotels are found, the user is informed and asked if they want to try a different selection. If they decline, an apology is issued for not being able to find a suitable option. Should hotels be available, a list is displayed to the user, who then decides if they are satisfied with the options. If satisfied, the user is asked to rate the service; a good rating prompts a thank you message, while a fair or poor rating leads to a request for feedback to improve future service. If the user opts not to leave a review, they are thanked for using the service and the interaction ends. If the user is dissatisfied with the hotel options, they are asked if they want recommendations for other hotels. If they decline, the service ends; if they accept, the search process starts over. This cycle aims to ensure user satisfaction by continuously refining search results based on user feedback and preferences."
    },
    "6ecb63f6-74ce-4f9a-bdcb-d25c04dce41a": {
        "domain": "Customer Service",
        "role": "hotel_reception",
        "scenario_name": "Book a hotel room",
        "workflow": "The flowchart outlines a process for booking a hotel room which starts with the system asking the user for the hotel name and the number of rooms needed. It then checks the availability of rooms by calling an API. If rooms are available, the user is notified and asked to confirm the booking. At this stage, the user is warned that once a booking is confirmed, it cannot be altered, and they are urged to consider their decision carefully. If the user confirms, they are asked for personal and payment information to finalize the booking. The system attempts to book the room and if unsuccessful after two tries, it suggests looking for alternative accommodations. If rooms are not available initially, the user is offered the option to book a different hotel. If the user declines, the process ends with an apology for not being able to accommodate them. Throughout this process, successful bookings are confirmed to the user, and in cases of failure or unavailability, the system provides appropriate feedback and options, ensuring clear communication at each step."
    },
    "acb85afe-23c5-49b5-b66a-9615b1df0260": {
        "domain": "Customer Service",
        "role": "hotel_reception",
        "scenario_name": "Book a hotel",
        "workflow": "The process starts with a task to book a hotel by asking the user for the name of the hotel they are staying at, and then calling an API to retrieve details about the hotel. If the hotel is found, the process continues by informing the user of the reservation fee and asking if they want to make a reservation. If the user hasn't confirmed, they are told that they can take their time before replying. If the user confirms, they are provided with a payment link for the reservation fee and the system checks if the reservation is successful. If it is, the user is informed of their room number. If the hotel is not found, the user is asked to provide a new hotel name. If the reservation fails, the user is asked if they want to try again or not. If they do, the process loops back to finding a hotel; if not, the user is apologized to and bid goodbye. This summary simplifies the flow of actions from booking a hotel to either successfully reserving a room or ending the process based on the user's decisions or the success of the reservation."
    },
    "b8a59056-00a4-4457-aa4f-f361ece37b1f": {
        "domain": "Robotic Process Automation",
        "role": "seal_management",
        "scenario_name": "Seal Request",
        "workflow": "The process begins with identifying the type of seal needed among the official seal, financial seal, invoice seal, and contract seal, based on the user's requirement. If the user needs an official seal, it's determined whether it's required for documents like letters, official documents, contracts, and other company materials. If not, the seal is not required. For financial or contract seals, the user is informed that these seals are for exclusive use and not for external printing services. In the case of an invoice seal, it's essential to ascertain if the invoice is electronic or paper. Electronic invoices might not need stamping if certain criteria are met, while other types do. When stamping is required, it's important to confirm if the document is electronic or paper. For paper documents, the financial office handles the stamping, and the user must contact the company's head for the finance office location. For electronic documents, an application call is needed to request stamping, with outcomes visible in three to six hours, depending on the seal type. If no stamping is required, the user is informed that the print request cannot be approved due to non-compliance with company regulations."
    },
    "1e9503fd-0460-4d53-bb02-80dc443cfee2": {
        "domain": "Robotic Process Automation",
        "role": "seal_management",
        "scenario_name": "Seal State Notification",
        "workflow": "The process begins with the confirmation of the user's identity. This is done by asking the employee who answered the phone for their name and work number, and then calling a function to get the employee's status based on the provided information. If the identity matches, the employee is informed about the print request result and the next steps. If not, an apology is issued to the user. Assuming the identity is correct, the next step is to obtain the printing results through a function call, and the outcome of the application (successful or failed) is determined. If the application is successful, the user is asked how they prefer to receive the document: by picking it up themselves or by delivery. If they choose to pick it up, they are informed of the pick-up location and number. If delivery is the preferred option, the user's workstation location is gathered, and they are told to wait there for the document, with a note that it won't be delivered if no one is present at the time of delivery. However, if the application fails, the user is notified of the reasons, which could either be non-compliance with document specifications or insufficient application information, and is advised to contact the printing supervisor before reapplying."
    },
    "5c7032fe-6c0c-4a2d-8c43-cc6e006aa387": {
        "domain": "Robotic Process Automation",
        "role": "attendance_arrangement",
        "scenario_name": "Attendance Anomaly Detection",
        "workflow": "The process described in the flowchart begins with a start point that leads to asking a user if they are aware of any instances where they left early or arrived late. If the user is unaware of such instances, the next step asks if they checked in, leading to two possible outcomes: if they did check in but there's no record, it implies a check-in failure due to possible user error, advising them to follow check-in regulations next time; if they did not check in, the process inquires about the reason for their early leave or tardiness, which could be due to facial recognition failure, congestion, or other reasons. Should the user be aware of their tardiness, the process similarly inquires about the reason. For facial recognition issues, it attempts to collect the user's facial information and ensure its accuracy. If the user forgot to check in, the process evaluates how often this has happened within a month, leading to informing the user about their excess tardiness if it's more than three times, or simply reminding them to not be late if less. For other reasons not checking in, these are collected for further examination. The entire process aims to identify and address issues related to tardiness or early departure, ensuring compliance with check-in protocols and understanding the reasons behind these occurrences to provide suitable guidance or corrections."
    },
    "11fd35e3-a085-46ac-8321-47018196b9d9": {
        "domain": "Robotic Process Automation",
        "role": "attendance_arrangement",
        "scenario_name": "Shift Handover",
        "workflow": "The process begins with confirming the user's identity through getUserInfo. If the identity is verified, the next step is to inquire if the user's shift transfer request falls within or beyond three days. For an incorrect identity, the service is denied. If the shift is within three days, it's checked if the user has found a successor of the same level within the company; if not, the user is asked if they need help finding one or will continue the search themselves. For shifts beyond three days, the user is instructed to apply in writing through their supervisor. If a successor is found, shift information is collected for the transfer. If the user decides to find a successor with our help and exchangeable employee information is available, the user is advised to contact them directly; if not, the user is asked if they wish to upload their request for others to see. Depending on the user's decision, their request is either uploaded, or they're apologized to for the unsatisfactory service if they choose not to upload their information."
    },
    "0a560d1f-cccd-4dc4-b229-95a2c28f0953": {
        "domain": "Robotic Process Automation",
        "role": "invoice_management",
        "scenario_name": "Invoice management",
        "workflow": "In a simplified natural language description of the flowchart, the process begins with a start point that branches into three primary actions based on the user's choice. First, if the user opts to check a ticket, the system calls a function named lookTicket to view the ticket's details. It then proceeds to inform the user of the ticket's specifics, including the content and any associated invoices, if the user expresses interest.\n\nSecond, if the user imports tickets via SMS, the system validates the new ticket by analyzing the SMS content. A function called checkTicket determines whether the ticket exists. If a ticket is found (is_exist is true), it is imported into the user's ticket package through a function named inBar. However, if no ticket is found (is_exist is false), the user is informed that the SMS content is invalid and advised to check the SMS content again.\n\nLastly, if the user chooses to send tickets, the system employs a function sendTicket to email the ticket to the provided address. The success of this operation is confirmed if the returned value is_success is true, indicating successful sending. Conversely, if is_success is false, the user is prompted to verify the email address provided.\n\nThis process encapsulates various tasks related to handling tickets, including checking, importing, and sending tickets, each with specific subgoals and descriptions guiding the user through the system based on their choices and the information provided."
    },
    "91e3d725-792c-473f-b731-47c3f216439b": {
        "domain": "Robotic Process Automation",
        "role": "invoice_management",
        "scenario_name": "Invoice reimbursement",
        "workflow": "The flowchart you provided describes a process for invoice reimbursement. The process starts with the user attempting to view their tickets through a call to the \"lookTicket\" function. If the function returns a success message, the user is shown their invoices and is asked if they want any of them reimbursed. If not all invoices can be reimbursed, perhaps due to expiration or previous reimbursement, the user is informed accordingly. If there are no invoices at all, the user is told to collect tickets first, with a suggestion that other processes for obtaining invoices might also be applicable. If all invoices are eligible for reimbursement, the process moves to a fast reimbursement step where \"trimTicket\" is called to generate a reimbursement link, which is then shared with the user. Following this, the user is asked if they want to submit this link for review. If they do not wish to do so, the process ends with a goodbye. Alternatively, if the user opts for review, further inquiries about submitting to the last section may occur, leading to a call to \"reimburse\" for final moderation. This entire process ensures that users can view, select for reimbursement, and possibly review their invoices in a structured and user-friendly manner."
    },
    "1e056ba1-4084-4ad6-8db7-276cd2ecd51b": {
        "domain": "Travel&Transportation",
        "role": "driving_service",
        "scenario_name": "Consultation and appointment for Substitute driving service",
        "workflow": "The flowchart describes a process where a user starts by applying for a substitute driver service. Initially, the system asks for details necessary for making a driving reservation like the time, start, and end points. It then consults its service via an API to check if a suitable vehicle is available. If there isn't a matching vehicle, the user is informed and asked whether they want to try selecting again. Should the user choose not to re-select, the process ends with an apology for being unable to find a suitable vehicle. However, if a vehicle is available or the user decides to re-select and subsequently finds a suitable option, the user is then informed about the vehicle model and asked for confirmation to proceed. If the user confirms, the system attempts to place an order. Successful orders prompt the user to leave a review, while unsuccessful ones result in an explanation of why the order couldn't be completed. User satisfaction with the service leads to gratitude expressed by the system, whereas dissatisfaction results in a promise to make improvements for better service in the future. This process leverages user data like free time, formatted as “year+month+day” (e.g., “2050年7月28日”), and interacts with various services (like listService and taxiService) to check vehicle availability and place orders, enhancing user experience by adapting to their needs and feedback."
    },
    "cc734648-5ba6-4039-b357-c57b7495693e": {
        "domain": "Travel&Transportation",
        "role": "driving_service",
        "scenario_name": "Cancel driving appointments",
        "workflow": "The process begins with the attempt to cancel appointments for substitute driving. Firstly, it involves asking the user for their reservation information, such as ID number and appointment time, and then using this information to search for the reservation. If the reservation information cannot be found, the user is informed of this and is given the option to either make a new appointment, try to look up the reservation again, or end the interaction. If the user decides not to proceed with any action, they are politely bid goodbye. On the other hand, if the reservation information is located, the user is asked to confirm their intention to cancel the appointment. Should they be unsure, advice is given to think it over; if they're sure, an attempt is made to cancel the appointment through an API call. The outcome of this action is then communicated to the user: if successful, they are informed that the cancellation has gone through; if not, the reason for the failure is explained. This process ensures that users are guided through every step of cancelling their appointment, with clear communication and options provided at each stage."
    },
    "00eb0b19-2092-48a3-811c-530f52171e8f": {
        "domain": "Travel&Transportation",
        "role": "driving_service",
        "scenario_name": "Change surrogate driving reservation",
        "workflow": "The process begins with the user wanting to change their surrogate driving reservation. They are first asked for their reservation information, which includes an ID number and a specific time. This information is used to search for the reservation. If the reservation cannot be found, the user is informed and asked if they wish to search again. This loop continues until the information is located. Upon finding the reservation, the user is then asked if they want to change the reservation details. If the user confirms the change, they must provide the new origin and destination, and an attempt is made to change the reservation. If the change is successful, the user is informed of the success. If not, the user is told why it was unsuccessful and asked if they want to try to change it again. This loop also continues until a successful change is made or the user decides not to proceed, at which point the process ends."
    },
    "ca37c286-01eb-481c-8b63-5bebd28fad75": {
        "domain": "Travel&Transportation",
        "role": "ride_service",
        "scenario_name": "Initiate a ride order",
        "workflow": "The process begins with booking a ride where it inquires about the user's name, drop-off destination, and ride time, then searches for available rides to confirm their availability. If rides are available, the system presents these options to the user asking them to select based on vehicle type and confirms this selection. Upon confirmation, the booking is made, and details are provided to the user who is then asked to rate the service as excellent, good, fair, or very poor. If the user doesn't confirm the selection, they are informed that selections cannot be changed once confirmed and are asked to think carefully. Depending on the rating, if it’s excellent, gratitude is expressed and a commitment to maintain high standards is made. For ratings of good, fair, or very poor, thanks are given for the feedback with a promise to improve. If no review is given, an apology is issued to the user before saying goodbye. If no rides are available initially, the user is invited to re-enter their details, and if they decide not to, the process ends with an apology and goodbye."
    },
    "79c7091b-cc86-46d8-8542-4ec75e882600": {
        "domain": "Travel&Transportation",
        "role": "ride_service",
        "scenario_name": "Initiate a ride change order",
        "workflow": "The given flowchart describes a process for handling ride changes in a transportation service. The process begins with the step \"Start,\" where the service confirms the availability of changes by asking the user for the number of people transferring, the boarding time, and the boarding location. This information is used to call a function \"lookTransferVehicle\" to check if changes are possible based on the returned vehicle information. If changes are available, the user is informed about the currently available options and asked whether they want to select one. If the user chooses an option, they are notified that the reservation is successful, and their phone number is collected for a call notification when the car is about to arrive. If the user does not select an option, they are asked if they need to change their requirements. Should a change be confirmed, the process loops back to confirm changes availability; if not, the process moves to apologize to the user for the limited availability of cars and difficulty in securing rides, thanking them for their choice and suggesting they try again in half an hour. If initially, no suitable changes are found based on the user's information, they are invited to resupply their details to check again for availability. This loop continues until a satisfactory resolution is found or the user chooses not to alter their requirements, ending the process."
    }
}